[
{"rating": "2.0", "review_title": "Looks good, but flawed", "review_body": "We ordered this calculator for our son's birthday. When it arrived, it was immediately clear that the display was broken as the electronic ink was permanently shown on the display at the right hand side. I returned the calculator without opening the package and requested a replacement."},
{"rating": "5.0", "review_title": "Just what I was looking for.", "review_body": "Why do I need a blue calculator??? Well, other than the fact that I just like to be different, I am seriously tired of my co-workers walking off with my calculator. The plain grey calculators all look alike. This is a big enough calculator that people can't easily hide or deny if I walk up and I can see it...And I can see it from a ways away. There is no denying that this is my calculator."},
{"rating": "1.0", "review_title": "Poor quality - only the bottom half of numbers show up!", "review_body": "Bought 12 of these for my special education classroom. They get used about 30 minutes per day total and I have had them about 2 months now. They worked fine at first, now only the bottom half of numbers show up on the screen - so they are totally unusable. The design is nice, large buttons easily manipulated by children and with large visuals to go by. But the quality just isn't there. I would not recommend."},
{"rating": "3.0", "review_title": "OK, but battery is NOT replaceable", "review_body": "Arrived quickly. Good design, simple and uncluttered for basic tasks with large well marked keys. Since it is also battery powered I was a bit disappointed that the screen wasn't backlit. I needed a battery operated calculator as I often need to use one in fairly low light situations and the solar powered one I have was a pain.  Then looked in the instructions for the battery type that it used, and found out that the battery is NOT replaceable. When the battery dies, you have a solar calculator only. That should have been in the description of the item."},
{"rating": "2.0", "review_title": "Not quite a 10-key calculator", "review_body": "The color is true to the product pic, and the keys work so far (they're a hard plastic), but the positioning of the keys aren't intuitive, if you're accustomed to standard 10-key calculators. Keys 1-9 and the arithmetic operations are fine - these are in a standard location, but who puts the \"ON\" button on the side middle? I'm constantly pressing the \"CE\" button instead, which won't turn on the calculator. I'm also used to having the \"+/-\" , 0, and \".\" in other placements, but these are minor in comparison to the power button positioning. Basically, the layout forces you to look and find what you need, rather than typing away."},
{"rating": "1.0", "review_title": "Buy a Texas Instuments calculator instead", "review_body": "I've used lots of calculators throughout my life and I've got to say that this calculator is by far the worst calculator I have ever used!!!  Two main reasons: 1.  the calculator doesn't calculate percentage like other calculators.  Meaning on a regular calculator if you input a number and push the percent sign the calculator would convert that number to a decimal.  And if you used the percent to calculate the percentage of tax for example the calculator would usually give you the percentage amount then the total.  2.  There is no OFF button.  It takes 10-12 minutes to automatically shut off.  I know its dual powered but its such a waste of power and I like to make sure I shut my things off."},
{"rating": "1.0", "review_title": "Horrible, cheap junk!", "review_body": "Cheap junk!  I chose this calculator because I really liked the color & overall look. I just needed a basic 10-key style calculator.  The size is fine, but the buttons are horrible!  It's so frustrating to use that I finally threw it away, and I really hate to waste things like that!  Even when you're trying to hit the keys carefully (as opposed to quickly by touch), it's still really hard to get the keys to work consistently.  They stick a lot or just don't make contact.  It's also very light and slides easily while you try use it.  You need one hand to hold it and one to type (and re-type and clear and re-type again)."},
{"rating": "4.0", "review_title": "neat colors, but quality not equal to Sharp, Casio, or Canon", "review_body": "I bought this Avalon calculator for its large size, its shape (I like that the display is angled upward a little), and for the selection of fun colors. I chose green. It's solar-powered but also comes with a battery for use in darker environments. Love the jumbo display, buttons, and the huge 'equals' button - the one button you use all the time."},
{"rating": "3.0", "review_title": "Functions but very cheap", "review_body": "This pink calculator is cute and functions ok, but it's slightly frustrating to use because you have to push so hard on the buttons to make them work. I've messed up my calculations many times because I'm going too fast and realize that a number didn't register. You have to push really hard and go slow. It's ok for simple calculations and is easier than getting my iPhone calculator out each time but it's very low quality. You get what you pay for."},
{"rating": "4.0", "review_title": "Definitely Does the Job", "review_body": "I bought this calculator after I spilled coffee over the one I always have on my home office desk.  I needed a basic calculator - no fancy bells or whistles, just reliable, easy to read calculations.  I've been using it daily for over a week and find nothing to complain about:  operates on dual power (solar/battery) so is bright and clear even when stored in a drawer for a while; easy to read display,  large number/function keys that are easy to locate and read, very reasonable price,  - the cute color doesn't hurt either."},
{"rating": "4.0", "review_title": "Cute basic calculator", "review_body": "My original receipt arrived not working correctly.  The screen didn't fully display all the digits.  The vendor replaced the item quickly.  Nice to do business with a vendor that stands by its products.  I purchased this for my 6 year old who is interested in math.  Since green is his favorite color, I thought this would be a hit.  The buttons and display are large. Which makes it easy to use for a beginner.  Basic calculator that meets my son's basic needs. It's not heavy and the rubber feet keep the calculator from sliding around."},
{"rating": "4.0", "review_title": "Cute and Colorful!", "review_body": "When I had to replace my calculator, I was looking for something colorful for my desk at work and this little calculator caught my eye. I love the big numbers and function keys. They're easy to see and it's small in size so doesn't take up a huge space on my desk. One thing that bothers me is the overhead flourescent lighting makes the display difficult to see as there's a reflection problem, but it seems to be the same with whatever calculator I've used so that's not a problem as I just angle it so the lights don't shine directly on the display. The battery is not replaceable but since it's also solar powered, that's not a huge problem, but it really should have been addressed in the original product description. I love this colorful little calculator that adds a touch of pizzaz to my desk."},
{"rating": "2.0", "review_title": "Returned.", "review_body": "The calculator that I received was defective.  The Error code was present from the beginning and would not clear.  The unit would not perform any calculations other than addition.  Thinking that it just needed more power, I then tried to let it get some solar power for a day or so--but that failed to resolve the issue."},
{"rating": "3.0", "review_title": "Display malfunctioned after less than a year of use", "review_body": "Worked well for a while, but after several months the display began to malfunction, showing malformed numbers (segments gray or unlit instead of black). Maybe the battery needs replacement, but in bright light the \"solar\" panel should provide enough power even with no battery power; mine doesn't. Otherwise, no complaints, except maybe that it is very lightweight and doesn't always stay put in use."},
{"rating": "4.0", "review_title": "Not Recommended for One-Handed Office/School Work", "review_body": "As for functionality, calculations work as they should, however it has a few quirks that make it unsuitable for my needs."},
{"rating": "2.0", "review_title": "Calculator wobbles/flips up when you tap the + sign", "review_body": "The calculator works fine but the rubber feet on back that keep it in place do not do their job. The + button is SO far over to the side, when you punch in the + the whole calculator wobbles/flips up even with a normal tap. It's the most annoying thing, I can't even use it for one garage sale I bought it for. It's a shame because otherwise it's fine. Definite return."},
{"rating": "2.0", "review_title": "I liked how big the screen was and the size of ...", "review_body": "The screen on the first one that I bought cracked so badly that I couldn't use it. I liked how big the screen was and the size of the buttons, so I purchased the same calculator a second time. This one does not have a cracked screen, but it does not work :( I have to press down really, really hard on the buttons, and it does not compute. I liked the look of this calculator, but I ended up getting a Casio standard function calculator. My grade depends somewhat on the functioning of the calculator. The one I received is not working."},
{"rating": "5.0", "review_title": "Probably my most used and favorite calculator.", "review_body": "Probably my most used and favorite calculator.  Large Digit Display and Bright too, some other calculators are not bright enough especially with solar powered.  Buttons are also bigger to maximize the space.  And, the 8 digit display gives you more calculating power.  Highly Recommended!!"},
{"rating": "4.0", "review_title": "Bright Pink Calculators are easy to Find in the Dark", "review_body": "Not a bad little calculator."},
{"rating": "1.0", "review_title": "Office Style 8 Digit Dual Powered Desktop Calculator", "review_body": "The Calculator I received right out of the package DIDN'T WORK... I followed the directions on how to charge it up, but it never did work... I feel that if your buying something new it should work... I would have replaced the battery, but the directions said not to because it could damage it. I guess you get what you pay for..."},
{"rating": "2.0", "review_title": "Buttons are not sensitive enough.", "review_body": "You have to hit the buttons dead center and hard to actually key in the number the first time.  I miss numbers if I don't snack the keys hard enough so this means you can't punch numbers in quickly or accurately."},
{"rating": "4.0", "review_title": "Not a bad calculator, 4/5 STARS....", "review_body": "This is not bad for the price. I am not giving the 5th star for 2 main reasons:"},
{"rating": "2.0", "review_title": "Only four of six worked out of the box", "review_body": "Read reviews that said some arrived not working but took a chance.  I teach special needs kids who need the big buttons.  Well, one of the six did not work at all and another only sort of works (the \"CE\" button doesn't work).  So, if you're willing to pay for six and get four, this is the deal for you.  Apparently, quality control is not a hallmark of Avalon."},
{"rating": "5.0", "review_title": "All the features I want and none of the features I don't want!", "review_body": "Love this! Perfect for my 12 year old who needed a calculator for math work, but without all the distracting bells and whistles. Big easy to see buttons and numbers on the screen. The big plus is that this works off of a battery when the solar panel is not working when you are working in lower light. When it arrived the screen was damaged and they quickly sent out a replacement."},
{"rating": "5.0", "review_title": "These worked great for my students", "review_body": "These worked great for my students.  They are super simple with only the functions needed for elementary school (1-6) math. The big buttons are great for little hands and for students who have difficulty with fine motor skills (OT issues).  My students especially liked them because of the bright color, saying they \"look like they're fun to use!\"  The visual was highly motivating.  Students always choose to use these over the regular black/grey/silver ones I already had.  I would definitely buy these again."},
{"rating": "1.0", "review_title": "Maybe nice if everything worked.", "review_body": "Unfortunately I didn't check out this calculator soon enough and then it was too late to return it.  My bad."},
{"rating": "2.0", "review_title": "Not Dependable in a Time Crunch!", "review_body": "This calculator sometimes shows a \"0\" after typing in several numbers and an action (multiply, divide, etc).  The numbers will come up as I type them but somewhere in the process, it is being erased from memory.  Maybe I'm hitting the keys too quickly, too much pressure, not enough pressure - I don't know why.  After using this thing for about 15 minutes I have tossed the two I purchased in the trash.  Sometimes it works fine and other times it doesn't.  I ordered two of these to use when taking a timed test for my real estate license and I absolutely cannot afford the inconvenience of having to re-input calculations.  I give it 2 stars because it should be fine if you have the time and patience to deal with the issue I described."},
{"rating": "2.0", "review_title": "This calculator has never worked. There is just a ...", "review_body": "This calculator has never worked.  There is just a scramble of incomplete numbers, impossible to read.  I have placed this calculator in direct sunlight, (for only a few minutes) or under an indoor lamp, and even waited 24 hours, it never works."},
{"rating": "4.0", "review_title": "So far so good", "review_body": "I received this yesterday, it works just fine. The only problem I have is it was shipped with no fillers inside the box so the calculator was bouncing around and came out of its original packaging. No idea how much damage was actually done but since it works there's no reason to return."},
{"rating": "4.0", "review_title": "It's big and pink lol it almost looks like a kid toy", "review_body": "Idk what I was thinking lol it's big ok . It's big and pink lol it almost looks like a kid toy . It works though but I think it's for kids. I'll be giving it to a little cousin . Cute but not suitable for adults (humble opinion ) ."},
{"rating": "4.0", "review_title": "Nice Calculator...", "review_body": "Haven't had time to make a whole lot of use of this item yet, but here is my initial quick and dirty --- good product...  display is good and dark, easy to read.  Calculator is large enough to sit still when being used, but small enough to tuck away nicely when not in use. Buttons are reasonably large and easy to use without fat-fingering.  My only negative is the battery is not replaceable.  I know, it is solar powered, but that assumes you will always be working in a fairly well lit environment... Not always the case."},
{"rating": "2.0", "review_title": "she loved it, she got so upset that it died", "review_body": "After 2 years of use, it died.  Can't figure it out how to change battery.  I bought this for a friend, the pink one, she loved it, she got so upset that it died!"},
{"rating": "2.0", "review_title": "Item arrived with a scratch on the screen, within ...", "review_body": "Item arrived with a scratch on the screen, within its sealed package.  Since the package itself was not damaged in any way, it must have been packaged with the scratch while still at the factory.  The calculator appears to work, so 2 stars for that.  Amazon will give me a refund if I re-order, so when an undamaged calculator arrives, I will likely upgrade this this review."},
{"rating": "5.0", "review_title": "What a great calculator for a person with low vision", "review_body": "What a great calculator for a person with low vision.  The design is well thought out and it has the look, feel and function of a high quality calculator. The display is super easy to read and the keys are large, well laid out, and work very smoothly.  Kudos to Avalon Electronics for putting the effort into designing a product that was actually made to last in what has become a throw away society.I highly recommend this product.  If fact, I plan to order a second one!"},
{"rating": "3.0", "review_title": "that seems like too long and too much battery usage before it ...", "review_body": "Item is as described and seems to work well.  The only thing I don't care for is that there is no off button and that instructions say it will go off automatically after 11 minutes.  Since this is only for home use, that seems like too long and too much battery usage before it shuts off.  A button to handle it yourself would have been nice."},
{"rating": "1.0", "review_title": "Not for indoor use", "review_body": "From day one, these calculators would not work, except near a window, and not after it started to get dark outside. My kids need to be able to work at their desk, so we sent them back."},
{"rating": "5.0", "review_title": "This has been a great calculator for me", "review_body": "This has been a great calculator for me. I need to use a calculator at work daily and this one  is easy to use, the number keys stick out slightly so they are easy to hit and hard to miss. I've had calculators in the past where you have to make sure to hit certain number keys exactly the right way and this calculator is not like that!  It's also big enough that it's easy to read but small enough that it's not in the way."},
{"rating": "5.0", "review_title": "Great calculators at a reasonable price.", "review_body": "This past order of the Avalon calculators makes over 2 dozen that I have ordered. That is not because they don't hold up to everyday use, but quite the opposite!! These calculators stand up well in everyday use. This is  the best calculator that I have found (and I have tried many) for my application... in the cabs of my fleet of over 70 trucks in the plumbing & heating and fuel delivery business. The large buttons, large displays, dual power are what my guys like about these Avalon calculators. I like that I have found something that stands up in daily use. I also like the dual power and the bright colors.  The only Avalon calculators that have failed on the job were due to being crushed or smashed.  If you are looking for a great, yet inexpensive calculator, this is my recommendation."},
{"rating": "5.0", "review_title": "Jitterbug of Calculators", "review_body": "Basic simple calculator.  Works great for my pluses, minuses & goes-into's. Big keys are easy to see and aren't crowded together.. Love the color. Have no problem finding it among my cluttered desk. It's the \"jitterbug\" of calculators."},
{"rating": "1.0", "review_title": "Find another brand", "review_body": "Came to me damaged and unusable.  Missed the deadline for returning, so I own a worthless calculator. Find another brand, or you'll also be out $8.00."},
{"rating": "4.0", "review_title": "Good Features for the Price", "review_body": "This calculator replaces two that I was using previously."},
{"rating": "5.0", "review_title": "My son loves this!", "review_body": "Bought this for my almost-5-year-old for Christmas and he absolutely loves it.  It's his favorite toy.  He loves being able to add up numbers!  Great product and great price!  And it's been thrown around with three toddlers in the house and is still working just fine."},
{"rating": "3.0", "review_title": "Large Keyboard Avalon Calculator", "review_body": "I ordered this calculator for my wife, giving her bigger keys and a larger view screen than my Casio Sl-300VC.  This Avalon calculator works just fine but I find it is clunky compared to the Casio, which is similarly priced.  Unless you need the large keyboard, I think the Casio is preferable.  They both do the same practical job."},
{"rating": "3.0", "review_title": "Tips easy if you push the buttons too hard", "review_body": "I didn't really need a calculator but I couldn't resist the purple one!  The numbers on the buttons and the display are clear and easy to read and it seems to work pretty well in fairly dim light. The only issue I have is that the edges are kind of rounded so if you push the buttons on the side too hard (for instance the plus sign) it tips easily.  It doesn't tip over, just to the side you are pushing (like a see-saw.) The calculator this replaced was squarer and didn't tip."},
{"rating": "5.0", "review_title": "Perfect size, large clear display", "review_body": "Perfect size, large clear display, large contrasting buttons, great viewing angle, lightweight and cool looking. Just what I was looking for. Great price too !"},
{"rating": "5.0", "review_title": "I LOVE MY WONDERFUL PERFECT CALCULATOR!!!", "review_body": "I FINALLY FOUND MY PERFECT CALCULATOR, THIS GREEN IS SO VIVID, THIS CALCULATOR HAS EASY BUTTONS, FUN LOOKING, YET, DEPENDABLE, AND THE PRICE IS FAIR. I'M VERY HAPPY WITH MY PURCHASE, THANK YOU FOR THIS WONDERFUL CUTE CALCULATOR!!! I LOVE IT SO MUCH !!! 5 STARS!!!"},
{"rating": "5.0", "review_title": "Colorful Calculator for a Beginner to Experience Adding and Subtracting.", "review_body": "Our four year old granddaughter  the color  PINK.  She is just learning how to add/subtract, so this calculator is a perfect tool."},
{"rating": "1.0", "review_title": "Horrible product", "review_body": "DO NOT BUY THIS, it's cute and a good size, but after only using it a few times it didn't work, the screen would light up weird. Couldn't even read any numbers. I emailed customer service and they did not get back to me."},
{"rating": "4.0", "review_title": "Great price and works well under normal indoor lighting", "review_body": "Great price and works well under normal indoor lighting. The calculator is great for grade school kids learning how to use a calculator."},
{"rating": "4.0", "review_title": "great for the price!!", "review_body": "The arrangements of the buttons takes some getting used to - the = on all other calculators I've used is on the right so muscle memory leads me to the wrong buttons!  Works perfectly so far and the neon color makes them much easier to find on a messy counter or desk!"},
{"rating": "3.0", "review_title": "Good basic calculator.", "review_body": "Works fine but the body is warped slightly so it doesn't sit flat on a table. It rocks to the side a little with every entry which is distracting."},
{"rating": "5.0", "review_title": "love, love", "review_body": "love, love, love my new purple desktop calculator.  I was after the color but was delighted that the calculator itself has a nice soft touch for the keys and is very responsive. Glad I had gone ahead and purchased two."},
{"rating": "5.0", "review_title": "Works Fine", "review_body": "It's not up to the Amazon Basic which I love, as it has no \"off\" switch.  But it's handy for quick calculations and I'd buy it again."},
{"rating": "4.0", "review_title": "Calculator is nice and large and the color is amazing (I got ...", "review_body": "Calculator is nice and large and the color is amazing (I got green and it looks exactly like the picture). Only reason I give four stars is because it is difficult to see the numbers unless you have the calculator right under your nose. Not a deal breaker, but it makes it a bit difficult to use on a desk. I still love it though and will continue to use it!"},
{"rating": "2.0", "review_title": "Cheap cheap cheap", "review_body": "You pay for what you get.  The buttons stick.  When the battery dies after 3 months, you can't replace it.  I did just need a cheap calculator, but was actually surprised at just how cheap this was."},
{"rating": "3.0", "review_title": "Freezes Up", "review_body": "I wanted to update my office supplies, as the ones bought by the person previously holding my position at my job had very outdated supplies. I love the colors of this calculator, so I was immediately drawn to it. The buttons are a decent size, and it's not big or bulky. However, it freezes up about every other time I use it. Luckily, my computer has a calculator. But this really deters me from using this calculator over the one on my computer/phone."},
{"rating": "2.0", "review_title": "It's a crappy calculator. Does basic calculations (addition", "review_body": "It's a crappy calculator. Does basic calculations (addition, subtraction, division and multiplication) but that's about it. While it does get the job done, buttons rattle and the body of the calculator feels cheap in general. I bought this to use during tests that don't allow graphing calculator, will probably give it away after I'm done with it."},
{"rating": "5.0", "review_title": "and the price was good.", "review_body": "I bought this to use for my FAA Written test.  Very basic and did what I needed.  and the price was good."},
{"rating": "2.0", "review_title": "The button sizes on these are great. However I wish the display was tilted a ...", "review_body": "The button sizes on these are great. However I wish the display was tilted a little more upright. You have to be directly in front and above it to see. I use a calculator frequenty to the side of my desk and at most angles, I cannot see the screen."},
{"rating": "1.0", "review_title": "CRAP", "review_body": "Numbers and buttons are large so thats a plus.  It is made out of a light weight plastic so feels cheap  I have only had it a short time so i hope it last."},
{"rating": "3.0", "review_title": "Light duty calculator", "review_body": "The 0 key started sticking day 1. I use my calculator every day so swamped this one into another area in our business that gets less use. Was really hoping to make this my everyday calculator since the bright blue color would have been easy to track down if it got borrowed off my desk."},
{"rating": "5.0", "review_title": "I like this", "review_body": "This calculate is good. It is a decent size so it won't get lost. It has clear directions in the instruction paper. It works well and is exactly what I needed."},
{"rating": "3.0", "review_title": "Taking A Chance With Used Warehouse Deals", "review_body": "My review is based on a purchase from the \"Used\" / \"Warehouse\" option."},
{"rating": "5.0", "review_title": "Green, Green Avalon does the trick for me!", "review_body": "I liked everything about it including the color which I ordered specifically because I use it for my budget computations and it is a very bright and cheerful green.  The only thing I would like to see on it would be an \"off\" key.  I know it goes off automatically if not used but I just like an off button.  I guess that is just me."},
{"rating": "4.0", "review_title": "I like it.", "review_body": "I like the large buttons. Though it is silly I like the color. It's got a cheerful look. The only drawback (minor) is when you hit the plus sign it tips a little."},
{"rating": "1.0", "review_title": "DO NOT BUY", "review_body": "Curved bottom makes it impossible to hit buttons without the calculator lifting and moving on table. The buttons only allow one press at at time and have a delay, so if you try to cleanly hit two buttons quickly you will miss a number, you have to go very slow. Between needing two hands to hold it steady and the terrible buttons always skipping numbers this is a completely unusable calculator."},
{"rating": "1.0", "review_title": "DON'T BUY IT...!!!", "review_body": "IT IS GREAT AS FAR AS COLOR AND LARGE KEYS BUT IT WON'T TURN ON AND WORKS ONLY IF I HOLD IT UNDER THE LIGHT OR IN THE WINDOW...JUST NOT WORKING RIGHT...WILL SEND IT BACK!!"},
{"rating": "1.0", "review_title": "Very disappointed. Guess I should've returned it", "review_body": "The LED is so faded. I couldn't it. Very disappointed.  Guess I should've returned it, but I through away the package and put the calculator on my desk, a few days later , I used it for the first time and found out it was so faded you couldn't read the numbers on the LED."},
{"rating": "5.0", "review_title": "SUPER CUTE!", "review_body": "super cute, huge buttons! really easy to use, I need a desk calculator for my home office, I loved this pink calc and it's a really nice size; slightly larger than the last desk calc I had but not so big it's like an adding machine! I love the solar power, if the battery goes eventually I can still use this, a perfect paring with my other pink office accessories!"},
{"rating": "5.0", "review_title": "Good.", "review_body": "I use this at work and at home. Love the big keys. And, it's pink!"},
{"rating": "3.0", "review_title": "It would be perfect for anyone with vision impairment", "review_body": "It does what a calculator is supposed to do.  The buttons are very large and a bit spread out.  It would be perfect for anyone with vision impairment.  I just use it to do quick math, so it works for me.  Note that is doesn't have tax buttons."},
{"rating": "5.0", "review_title": "It works!", "review_body": "It works, I can find it because of the bright color.  I bought two, one pink and the other purple.  Would buy again."},
{"rating": "5.0", "review_title": "Great Value", "review_body": "Great for the price.  I'm a middle school teacher and I ordered a class set of these calculators.  They have been very sturdy as they are dropped very often.  The big buttons are easy to use too."},
{"rating": "5.0", "review_title": "I am very happy with this calculator.", "review_body": "I love pink and this calculator is large and I can see it well . I need large print to be able to see the numbers on the calculator , and this works great for me."},
{"rating": "1.0", "review_title": "Can’t trust the temperature", "review_body": "I hardly used this and then destroyed a $120 roast by over cooking due to the thermometer saying the roast was a lower temperature than it actually was. Bummer"},
{"rating": "2.0", "review_title": "Disappointed!", "review_body": "This calculator is pretty, but you can hardly see the numbers when you sit it flat on a table.  If you angle it, it's fine.  But I need it to work flat.  Not thrilled with this at all. Disappointing purchase!"},
{"rating": "3.0", "review_title": "Meh", "review_body": "I does the basic calcs my wife and I need to do."},
{"rating": "5.0", "review_title": "Fun to use and love the big buttons.", "review_body": "I ordered this calculator because I need the big buttons for a lot of fast calculations. It didn't disappoint. It's great to look at and I make fewer errors because of the big buttons."},
{"rating": "3.0", "review_title": "Accurate Color", "review_body": "I got this for the color which is accurate, but the buttons are hard to push and seem cheap. Good for the price but I wish I didn't have to push the buttons so hard."},
{"rating": "4.0", "review_title": "This is great for quick uses", "review_body": "This is just what I wanted - a small, simple calculator that has keys big enough for fingers to feel.  This is great for quick uses, but especially helpful if I have longer columns of numbers to add quickly.  By the size of its keys I can add without having to watch my fingers hit the numbers."},
{"rating": "3.0", "review_title": "Nice price and color selection was to keep it from ...", "review_body": "Nice price and color selection was to keep it from getting stolen off my desk.  It does the job, but the button push feels bulky and must be deliberate if that makes sense.  The button push just does not feel as natural as other units.  However it will get the job done."},
{"rating": "1.0", "review_title": "Buttons are loose", "review_body": "The buttons are loose on this calculater. I had hoped for a better quality for the cost."},
{"rating": "5.0", "review_title": "Super Calculator", "review_body": "Very pleased with this purchase. We were looking for a calculator with larger buttons for ease of use. These are exactly what we needed and so far are performing perfectly. We use them for our dart league players in our retirement community, and everyone is so happy with them. The price was very attractive which made the purchase even better. When you can get what you want for a price that you like, then I guess you can not ask for anything more."},
{"rating": "5.0", "review_title": "Excellent product", "review_body": "These are excellent for elementary-middle school children!  The numbers are large and there isn't much \"fuss\" to the usage of this product.  My students (4th-6th graders) love these!"},
{"rating": "5.0", "review_title": "Avalon 8 Digit Dual Powered Desktop Calculator", "review_body": "Just what I was looking for. No bells and whistles or other fancy features, which I didn't need. Bought two of these in different colors. One for my vehicle and one for my office. Perfectly fits my needs. Both work great, no sticky keys or other misfires! Love it."},
{"rating": "5.0", "review_title": "Perfectly Calculating Purple!", "review_body": "Great color, solidly manufactured, and works perfectly!"},
{"rating": "4.0", "review_title": "Good Simple Calculator", "review_body": "I like the color, big buttons and big screen. Works well for a simple calculator."},
{"rating": "2.0", "review_title": "Super cheap. One came not working and two stopped ...", "review_body": "Super cheap.  One came not working and two stopped within 1 week.  I emailed the seller and have hear nothing back.  the ones that still work do their job but you can tell that these will not hold up."},
{"rating": "5.0", "review_title": "Great purchase", "review_body": "My little 4 yr old boy loves this calculator. He sleeps with it under his pillow. :) great for small children who are learning the fundamentals of calculator use. Also totally functional for adults. I love the size! I grab it for calculations here and there. Beautiful bright green color."},
{"rating": "5.0", "review_title": "Exactly what I wanted", "review_body": "I'm VERY happy with this calculator.  It's big but still fits in my hand. The keys are easy to push and the display is very easy to read.  It's everything I wanted in a new calculator. It's made well, It doesn't look like it's cheap or junky."},
{"rating": "3.0", "review_title": "Meh", "review_body": "It's an okay calculator. Cheap, lightweight. Chinese made. Much bigger than I thought it would be. Large keys & ample display but no memory.  Moves around on the desk a lot when punching in numbers in spite of the rubber feet.. Did I say cheap?"},
{"rating": "5.0", "review_title": "Great simple calculator!", "review_body": "This is exactly what I was looking for.  A simple calculator, with big numbers, works without the need for light.  I especially like the fact that the back of the calculator is bent forward so that the numbers on the screen are easily read.  Love the pink!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "This calculator is cute and functional I love it"},
{"rating": "5.0", "review_title": "Simple calculator! Just what I needed!", "review_body": "Can’t go wrong with this calculator!"},
{"rating": "2.0", "review_title": "Underpowered", "review_body": "Battery was DOA and the solar cell is not powerful enough to run the calculator in normal indoor lighting conditions unless you're directly under a focused lamp."},
{"rating": "5.0", "review_title": "I'm so glad my calculator bit the dust", "review_body": "I'm so glad my calculator bit the dust, it was so hard to use, and this one is a dream!  I love it!  The buttons are nice and big and so is the screen to see your totals!  It's still not to big to be on my desk, and it's bright color makes it easy to spot."},
{"rating": "5.0", "review_title": "fun calculator", "review_body": "Works as expected.  it does not say 1+1 =3"},
{"rating": "4.0", "review_title": "delivery time", "review_body": "The product is fine but the long delivery time is lousy."},
{"rating": "1.0", "review_title": "This calculator was defective – the display doesn't show the ...", "review_body": "This calculator was defective – the display doesn't show the full number (e.g. the \"3\" is missing the bottom stem, the \"2\" is half missing) so it was impossible to discern what it was showing. Also, the quality is really lacking - the plastic is cheap."},
{"rating": "1.0", "review_title": "One Star", "review_body": "Large, clumsy, awkward, cheap piece of plastic with keys that stick. Nuf said."},
{"rating": "5.0", "review_title": "Cute and efficient", "review_body": "This is an excellent desk calculator. I use it everyday at work. The buttons feel nice and are easy to press. This calculator makes crunching numbers fun!"},
{"rating": "3.0", "review_title": "The colorful calculator", "review_body": "Nice looking basic calculator. I like it except the operating keyboard must be pressed harder than any calculator I've owned. Other than that, it's a good looking device."},
{"rating": "5.0", "review_title": "Bought as a Gift for a Child", "review_body": "My granddaughter is always taking my daughter's calculator to play with. She calls it her typer. So, I got her one of her own. She loves it."},
{"rating": "1.0", "review_title": "Worked great for a couple months but now there is an ...", "review_body": "Worked great for a couple months but now there is an E on the screen that doesn't clear and the numbers do not fully display. Thought I needed to change a battery but after trying to find instructions online and reading other reviews I see that its not possible. Next calculator I will invest more money for something that will last longer. I am not normally one to write negative reviews, but I was extremely disappointed in this product."},
{"rating": "5.0", "review_title": "I love this little calculator especially because it is green", "review_body": "I love this little calculator especially because it is green.  I can easily find it among the clutter  on my desk."},
{"rating": "2.0", "review_title": "The whole reason I bought this is because it was ...", "review_body": "The whole reason I bought this is because it was dual powered. However the battery was dead upon delivery. You can't change the battery in it either. I needed one that runs off a battery because my work area isn't well lite."},
{"rating": "5.0", "review_title": "Dual powered calculator", "review_body": "Most pocket calculated I have seen only work on solar power and this one I believe works on batter also so I use it at the grocery store"},
{"rating": "5.0", "review_title": "Cute pink calculator from Amazon.com", "review_body": "It's a great calculator.  The large keys keep me from missing or hitting more than one number or action.  I do wish the screen tilt was more angled, but it is better than my last flat calculator.  Pink is one of my favorite colors."},
{"rating": "4.0", "review_title": "Nice color with large features", "review_body": "Got this as a gift. It's bigger than I expected the font and buttons are pretty large. But that may come in handy if you like/need that sort of thing."},
{"rating": "5.0", "review_title": "Here are a few reasons we are pleased with the purchase", "review_body": "My wife and I are thrilled with this basic calculator.  Here are a few reasons we are pleased with the purchase: dual powered means we don't have to be in bright light to operate it, the buttons are large and simple to use, the screen is slightly raised for easy reading, and the green color makes it a cinch to find in a drawer/cabinet."},
{"rating": "5.0", "review_title": "Nice but could use illumination", "review_body": "Simple, straightforward calculator.  Good choice."},
{"rating": "5.0", "review_title": "Attention Getter", "review_body": "We bought these because of the bright colors as they are easy to locate quickly when a customer is ready to check out. They all work well with large digital displays making our job easier as well as allowing the customer to easily read their tallies. Thanks for putting this concept into production."},
{"rating": "5.0", "review_title": "Handy Calculator", "review_body": "My old calculator died and I was looking for something smaller. This totally fits the bill. I just wish there weren't 5 of them!"},
{"rating": "5.0", "review_title": "My nine year old loves it!", "review_body": "Great color and display."},
{"rating": "5.0", "review_title": "I love everything about this calculator", "review_body": "I love everything about this calculator.  I love the bright color.  I love the big buttons.  I love that it is solar.  I love that I know this one won't go missing from my desk!"},
{"rating": "5.0", "review_title": "GORGEOUS PINK CALCULATOR WITH RED AND WHITE BUTTONS - AWESOME", "review_body": "My calculator that I'd had for 20 years finally gave up the ghost, and when I looked on Amazon and found one that was PINK, I was thrilled.  Of course, it works great.  The buttons are nice and big for my failing eyes.  Did I mention that it's pink?  I love it."},
{"rating": "4.0", "review_title": "Needs a little design help.", "review_body": "I like it a lot. My only complain is it needs to have a larger bottom than the top. The way it is when you hit a button on the edge it flips up off the desk."},
{"rating": "5.0", "review_title": "Get some Peace of Mind these work great", "review_body": "Great Product large screen nice big numbers so its easy to enter the numbers also in dim light the numbers still show up great"},
{"rating": "5.0", "review_title": "Great for the price", "review_body": "I am a middle school teacher and ordered these to use as a class set.  They are very sturdy and the large buttons make it easy to use."},
{"rating": "4.0", "review_title": "Great Calcualtor", "review_body": "My daughter just started 1st grade and one of the school supplies on the list was a calculator. I wanted a pink calculator with big numbers. This is exactly what I got! My daughter loves it. Of course because it's pink. :)"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Works great and the pink is sooooo cute!  It stays on my desk. Tank you."},
{"rating": "3.0", "review_title": "broke after 3 months. usually this style of calculator will last several years", "review_body": "Junk"},
{"rating": "1.0", "review_title": "Too bad, because it was so easy to use and ...", "review_body": "I purchased this in the first part of June and it stopped working a couple of days ago. It freezes up and you can't put any more numbers on the screen. I have tried numerous times to get it to work, but just does the same thing over and over. Too bad, because it was so easy to use and see."},
{"rating": "5.0", "review_title": "Perfect First Calculator", "review_body": "Purchased for a 5-year-old who has hardly put it down since she received it. Perfect size for little hands, and such a nice big display. The color is a big favorite, too!"},
{"rating": "5.0", "review_title": "works great", "review_body": "fast service ,works great"},
{"rating": "5.0", "review_title": "easy to read and handle", "review_body": "Large, easy to read and handle, works well."},
{"rating": "1.0", "review_title": "One Star", "review_body": "Broke after 3 month"},
{"rating": "4.0", "review_title": "Descent product", "review_body": "Good value for average quality. The big buttons and screens are easy to press and read."},
{"rating": "5.0", "review_title": "Big Button", "review_body": "Great big buttons, this is my second one bought.  Now I have one in my work office and home office.  No more tiny numbers either"},
{"rating": "5.0", "review_title": "right size for a desk", "review_body": "The calculator is very nice. The color seems to have a lot of pink in it. Not a real true deep purple in color. I recommend this product."},
{"rating": "1.0", "review_title": "This broke after 2 months - display stopped working. ...", "review_body": "This broke after 2 months - display stopped working.  I knew it was cheap but how does a calculator break?"},
{"rating": "3.0", "review_title": "Mobile Calculator", "review_body": "An inexpensive desk top calculator that will work for paying bills and balancing a check book when you don't want to bother with your computer or cell phone. Quick and easy and it works. The smaller children in the family got one for Christmas in hopes they will get a jump on pre-school math functions."},
{"rating": "5.0", "review_title": "It is not the best made item but for what i paid it definately ...", "review_body": "I thought I already left a review but in any event, I found the product to be perfectly acceptable for my needs. It is not the best made item but for what i paid it definately meets all my needs and expectations....."},
{"rating": "1.0", "review_title": "DOES NOT WORK! Wil try to return and not ...", "review_body": "DOES NOT WORK! Wil try to return and not sure if I would re-order, simple calculator that doens't work. It just turns on and doesn't do more... :("},
{"rating": "5.0", "review_title": "Very cute, vibrant calculator that does what it's expected to do!", "review_body": "Very cute, vibrant calculator that does what it's expected to do! I'm a math teacher and wanted a bold calculator for my desktop. One that was bright so that I could find it quickly and see if a student had walked off with it. This does the trick."},
{"rating": "4.0", "review_title": "It's a nice, big", "review_body": "It's a nice, big, blue calculator--just what I needed for my desk at work after my giant calculator called it quits. Nothing fancy but gets the job done. My big fingers like the big buttons, and it's hard for someone to walk off with it! The only little \"ding\" is that when you hit the plus sign, the calculator moves/wobbles just a little--a wee bit unstable, which is a minor aggravation, but not a big deal at all, really."},
{"rating": "1.0", "review_title": "Not happy with this calculator", "review_body": "Not happy with this calculator. The buttons are hard to press and the display doesn't even work right, rendering it useless. In the photo, it's supposed to read 12345678. I've had better calculators that have cost less than this one."},
{"rating": "4.0", "review_title": "I enjoy the fact they aren't \"solar only\" as some areas", "review_body": "I purchased these for used at our office.  We do constant daily computations in various locations, so tend to go through a lot of these types of calculators.  Thus far, they have worked well.  I enjoy the fact they aren't \"solar only\" as some areas, like our warehouse, sometimes can be a little dim and \"solar only\" calculators suffer.  For our needs, the price point is perfect for calculators that are essentially a disposable necessity around here."},
{"rating": "1.0", "review_title": "Save your $$$", "review_body": "I would highly not recommend purchasing this product. These calculators were purchased for a business. They are not accurate; for instance you enter 1+1 says the answer is 17.... and actually not one equations thaw was entered was correct.... Another high quality product from China.... NOT.... So please save you money on this product."},
{"rating": "5.0", "review_title": "Great for special needs kids!", "review_body": "Love this calculator!  Bought this for my autistic daughter to use at school.  She needed the bigger buttons.  I like the vibrant green color.  Seems better quality than some others I looked at.  Her special ed teacher wants more for the rest of the class to use."},
{"rating": "5.0", "review_title": "Great large key and display", "review_body": "Great large key and display.  Makes everything easier and functions great!  My 8 years old boys love it and I do too.  When I am looking for a calculator this is the one I choose to use."},
{"rating": "5.0", "review_title": "5 year old loves it", "review_body": "Got this for a five year old. He thinks it's pretty awesome, so giving it five stars."},
{"rating": "3.0", "review_title": "It's OK", "review_body": "Quality is ok. Looks and feels a little cheap. Seems to work fine but definitely will buy another brand next time I am shopping for a calculator."},
{"rating": "2.0", "review_title": "The size is good but the buttons were not very sensitive so I ...", "review_body": "The size is good but the buttons were not very sensitive so I have to press hard to get the numbers to click. I'd rather go with one of the more popular brands"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "I like it"},
{"rating": "4.0", "review_title": "Love the color", "review_body": "Love the color.  Would not want any larger.  Could have a few more functions and slightly smaller buttons.  Size is a bit overkill unless you have large fingers and/or vision problems."},
{"rating": "5.0", "review_title": "A simple calculator for simple needs...", "review_body": "I needed a simple calculator. This one works just fine and I didn't pay too much for it. Besides it's purple!"},
{"rating": "5.0", "review_title": "Absolutely astonishing:", "review_body": "I rated this Avalon 8 Digit Dual Powered Desktop Calculator five stars because it is simply awesome and meets all of my calculating needs. This item is highly recommended."},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "This thing should cost about $1. It's really cheaply made and I dropped it once and it broke"},
{"rating": "5.0", "review_title": "Perfect for my kids first calculator", "review_body": "Perfect for my kids first calculator. The color is very accurate and the buttons make it quick to type in without hitting the one next to it. I’m glad this one is solar so I don’t have to worry on tending to it."},
{"rating": "5.0", "review_title": "Very sturdy and well built", "review_body": "Very sturdy and well built. Great packaging. My granddaughter loved it for her little desk. I also bought the Post-it-Notes Pink heart shape dispenser to go with it. She loved it!!! She is 7."},
{"rating": "5.0", "review_title": "Bang for your buck", "review_body": "I know calculators are archaic to some,  but my 80 year old mother uses one to reconcile her monthly bills. This calculator is perfect for her: simple to use and has over-sized numbers on large keys.  Amazon Prime fast shipping on top of that.  You can't beat the price."},
{"rating": "5.0", "review_title": "Awesome!", "review_body": "Perfect size, large enough to be easy to use but not too large that it's inconvenient to have on desk. 5 stars easy."},
{"rating": "5.0", "review_title": "Big calculator for a little price...", "review_body": "\"Big & Simple\". It kind of says it all for this device.  My work requires a lot of quick and basic math so this product is great.  The buttons are firm but loose enough that I know what I pressed and the display is clear and big enough for sight challenged folks like me.  It's also very light weight and comfortable in your hand.  Great value for the price and I plan to buy a couple more for the home office."},
{"rating": "5.0", "review_title": "Highly recommend", "review_body": "Absolutely highly recommend. Excellent touch, look, feel, very well crafted.  highly recommend this product.  Excellent seller as well, product arrived exceptionally fast!!!!!"},
{"rating": "4.0", "review_title": "Good calculator", "review_body": "Love this little calculator. The only thing is that the \"CE\" (clear entry)button is on the bottom when I'm used to it being on the top, so I keep mistakenly hitting the % button instead. Be aware of that!"},
{"rating": "5.0", "review_title": "Great find, Cute plus works Well", "review_body": "Great find, Cute plus works Well. I needed a calculator to take to store. I really dislike Going over My Budget.  Yes a bit large, which I need for Me to see,, Buttons do not hurt my fingers for press down , due to health issues with hands.  I would recommond to Anyone.  Just Remember to care it a a somewhat Large Purse or Tote.  :)"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "I love this calculator. Just the right size. Works great and has big numbers!!"},
{"rating": "2.0", "review_title": "Sticky keys.", "review_body": "This calculator is nice in that it has nice big number, but it feels very cheap and the keys are constantly sticking. In retrospect I should have probably returned, but did not."},
{"rating": "5.0", "review_title": "Calculate your way to awesome.", "review_body": "It's a calculator alright. It adds, subtracts, multiplies THE WHOLE NINE! Plus it's pink. Bonus. Hang your t-98 out to dry and get this sleek basic model for all your math doin deeds. Sure your phone has a calculator but are the buttons THIS big. Spoil yourself. You deserve it."},
{"rating": "2.0", "review_title": "It was a cool looking calculator for very short money so it got ...", "review_body": "It was a cool looking calculator for very short money so it got two stars for that. But the display was very hard for me to read. Then after a few weeks the display lost parts of the numbers. But it didn't cost much so I didn't bother with return, and just tossed it. Oh well."},
{"rating": "5.0", "review_title": "Bon produit 👍🏼", "review_body": "Simple , discret , léger ,et sans trop de fonctions"},
{"rating": "5.0", "review_title": "I would get this again.", "review_body": "Very nice touch action. Easy to read. Cheerful. Great price. No problems whatsoever."},
{"rating": "5.0", "review_title": "Great", "review_body": "Everything was great. The product got here on time and in great condition. It was just as described and works well too boot!"},
{"rating": "1.0", "review_title": "Poor Quality", "review_body": "Quit working after 2 weeks!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Product was as describe looks great and easy to use. Good quality calculator, would recommend to others."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "this works great"},
{"rating": "4.0", "review_title": "Solar Calculator", "review_body": "Love the color, the big fun buttons..  it rocks when you do the  PLUS symbol.. so, you have to hold it, or touch lightly."},
{"rating": "5.0", "review_title": "A economical beginners calculator.", "review_body": "A economical, easy to read, large lettered calculator!"},
{"rating": "3.0", "review_title": "Almost great.", "review_body": "I love the size, color and large number pads, but the function keys are not in the usual places, I keep having to make corrections.  Weird."},
{"rating": "5.0", "review_title": "Good for AP test", "review_body": "My son used this on his AP Biology exam, as they cannot have a memory function calculator during the test."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "good value, my employees like the bigger key pads."},
{"rating": "3.0", "review_title": "Just OK", "review_body": "It is an Ok calculator.  For the money it does the job.  Buttons are a little flimsy.  It is Ok for occasional use, but do not buy it if you are going to use it everyday for business or school."},
{"rating": "5.0", "review_title": "people get a good laugh when they see this calculator on my desk ...", "review_body": "Haha, people get a good laugh when they see this calculator on my desk during tests."},
{"rating": "3.0", "review_title": "not for professional use", "review_body": "This is so lightweight, it flops when keys are pressed for functions. Needs more support bumps on the bottom to stabilize it better. I expected more usability for business calculations not requiring tape record."},
{"rating": "5.0", "review_title": "Hand size calculator", "review_body": "Very nice purple calculator with large numbers and its big enough to locate it"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Love it"},
{"rating": "5.0", "review_title": "Just the basics and does the job", "review_body": "I got this for my elderly mother who has cognitive issues and it works well for her for balancing her checkbook.  Not overly complicated, just the basics."},
{"rating": "5.0", "review_title": "Great calculator", "review_body": "Large numbers, easy to see. Simple no nonsense buttons...finally one without memory features that are useless.  Beautiful blue and pink colors."},
{"rating": "4.0", "review_title": "Good basic calculator, large buttons and display. Cannot easily replace battery.", "review_body": "Easy to use, large digits.  No \"off\" button, since it has auto-off feature after 10 mins.  took off 1 star because no easy way to replace battery. Will need to remove 6 screws to access inside (2 on edge, 4 under rubber feet).  Battery is most likely 1.5v button cell alkaline, I'll find out in a couple years."},
{"rating": "5.0", "review_title": "Color is fun and it works great!", "review_body": "I needed a very basic calculator for the elementary school kids I tutor. It's especially important for those with learning disabilities. This does the job and the color is fun."},
{"rating": "5.0", "review_title": "when you need a basic calculator", "review_body": "doesn't jiggle when typing, it's cute color &the numbers are easy to use like 10 key"},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "It does the job"},
{"rating": "5.0", "review_title": "Nice Office Buy", "review_body": "Great little calculators!!! Great Value for the money. Works Great very Happy"},
{"rating": "1.0", "review_title": "Awful. you have to pound the keys to get ...", "review_body": "Awful. you have to pound the keys to get them to register and so the unit wobbles all over. Just a shame someone could make this product."},
{"rating": "5.0", "review_title": "easy to see screen", "review_body": "My mother needed a simple calculator with big buttons, easy to see screen, and something that powers it besides the solar power strip.  Works as advertised.  Very happy with purchase."},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "The screens began to fade after a few months."},
{"rating": "4.0", "review_title": "It works great and I like it", "review_body": "It works great and I like it, good size for my RA fingers and poor eysight, some of the keys seem oddly placed but easy to get used to.  I really like it."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Love this can see the numbers without my glasses"},
{"rating": "5.0", "review_title": "I really like this calculator", "review_body": "I  really  like  this  calculator.  Many  of  the  smaller  ones  don't  have Percentage .This was an  important feature  to  me.  It's  also  very  attractive  and  also portable."},
{"rating": "5.0", "review_title": "the buttons are large and easy for a child to manipulate", "review_body": "My granddaughter requested a calculator for Christmas and loves this one.  It's colorful, the buttons are large and easy for a child to manipulate, and the display is easy to read."},
{"rating": "1.0", "review_title": "One Star", "review_body": "You have to use this calculator at a certain angle, or else you won't see the numbers. Returned."},
{"rating": "1.0", "review_title": "NOPE!", "review_body": "Buttons are not responsive enough. MUST press buttons multiple times for them to show. This will be going to my daughter as a play toy. I would not purchase if you plan on ACTUALLY working with it."},
{"rating": "4.0", "review_title": "Calculator is great for kids", "review_body": "Calculator is great for kids. Wish I had checked local stores though, because I found similar ones for so much less money."},
{"rating": "1.0", "review_title": "Buy a Casio", "review_body": "I'm sorry I had to write this but this is a product to avoid. Once you press the CE or +, - buttons (anything on the sides), half of the calculator moves up. It is not balanced out properly and is really annoying to work on while it moves like crazy. The buttons are hard to press. The color is gorgeous, though. I wouldn't buy it ever again. Just purchased a Casio, works like a charm. Will stick with that brand for sure. Never been disappointed with Casio."},
{"rating": "5.0", "review_title": "DESKTOP", "review_body": "GREAT VIEW ...."},
{"rating": "2.0", "review_title": "skip", "review_body": "clunky operations"},
{"rating": "5.0", "review_title": "Arrived quickly and in new condition. Thanks!", "review_body": "Does what a calculator does and arrived quickly. Thanks!"},
{"rating": "1.0", "review_title": "Don't waste your money on this garbage", "review_body": "Arrived defective, you get what you pay for. None of the numbers, except the number 8 worked, Don't waste your money on this garbage."},
{"rating": "5.0", "review_title": "Very nice", "review_body": "Nice item. Bigger than expected and appears very sturdy. My daughter wanted a pink calculator and I am glad I bought this one!"},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "had to return one because it didn't work so returned them both"},
{"rating": "5.0", "review_title": "A Bright, Happy Calculator You Won't Lose", "review_body": "Bright so you don't lose it with large numbers you can see.  Great calculator!  Good value."},
{"rating": "5.0", "review_title": "perfect", "review_body": "simple, inexpensive, perfect"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "good little calculators  would buy again"},
{"rating": "5.0", "review_title": "Awesome", "review_body": "Basic calculator that works great !!!"},
{"rating": "3.0", "review_title": "Purchased a year ago. Just stopped working. Its ...", "review_body": "Purchased a year ago. Just stopped working. Its still on, but nothing happens when you use hit buttons. Was hopingn to get more than a year out of it."},
{"rating": "5.0", "review_title": "Bright display, great value.", "review_body": "Perfect, simple, low cost calclator.  Nice bright display, large keys.  Wish that it had a memory key, but for less than $10, a great buy."},
{"rating": "4.0", "review_title": "Nice colour!", "review_body": "My kid loves it!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Product arrived ahead of promised date and was exactly as advertised, very satisfied"},
{"rating": "1.0", "review_title": "Don't waste your money", "review_body": "Don't waste your money. Didn't even work when I received it. You could hear stuff rattling around inside it. Wasn't worth even messing with return to me so I just threw it away."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Really cute 4-function calculator, bigger than expected. Thank you! ;)"},
{"rating": "5.0", "review_title": "BIG buttons; easy to hold!", "review_body": "Got this for doing craft shows, and it's excellent!  Big buttons make it easy to read, even without my glasses, but it's easy to hold in one hand!"},
{"rating": "4.0", "review_title": "Looks good, though we haven't tried it yet", "review_body": "We haven't actually used this yet, but my husband likes the look of it-- nice color, and large keys.  He's also pleased that it is solar-powered, so it should work well outside."},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "Worked well but for a short time"},
{"rating": "5.0", "review_title": "Works well and is a nice color", "review_body": "I really like the bright color of this calculator. Other than that, it works fine for all simple calculator functions. One thing I'm glad it has is the + - key to reverse positivity/negativity."},
{"rating": "1.0", "review_title": "CHEAP.  Buyer beware", "review_body": "I ordered two of these for our office.  One does not work. I guess you get what you pay for"},
{"rating": "1.0", "review_title": "One Star", "review_body": "A child's calculator. It works and shipped quickly, but photo deceived me."},
{"rating": "5.0", "review_title": "great value", "review_body": "the office calculators are a great value and the large numbers are great for the warehouse usage.  (we purchase them by color for each area of our facility) so far so good they work great!"},
{"rating": "5.0", "review_title": "Great Calculator", "review_body": "Works well. My mom needed a big button and easy-read calculator, and this one did the trick!"},
{"rating": "1.0", "review_title": "Dont waste your money", "review_body": "Luckily I paid next to nothing for this. Didn't work."},
{"rating": "5.0", "review_title": "Avalon calculator", "review_body": "Cute color and serves its purpose, which in this case is to keep my 3 yo son happy!"},
{"rating": "3.0", "review_title": "I'd buy something else next time", "review_body": "I have to push hard and double check it caught the number pressed, but cute color."},
{"rating": "5.0", "review_title": "Perfect, I like it", "review_body": "Perfect , I like it ...."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Works"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Not the greatest calculators, but for the price definitely worth it"},
{"rating": "5.0", "review_title": "A fun handy calculator", "review_body": "Works fantastically.  Simple to use, nice colour, and no batteries required.  The calculator is large, so I always know on exam days that I have it with me."},
{"rating": "5.0", "review_title": "This calculator is so pretty! Mine is pink", "review_body": "This calculator is so pretty! Mine is pink! It's lightweight, easy to use, easy to read. Just what I wanted. My iPad isn't always handy or I'm looking up numbers on the iPad and it isn't convenient to use the calculator on it so having a separate calculator just makes for a smoother process."},
{"rating": "5.0", "review_title": "Color has nice touch to simple cal", "review_body": "It serve its purpose but the color is very coooool touch to the \"just calculator\". I'd but it again for sure!!! 😃👍"},
{"rating": "5.0", "review_title": "Simple and colorful", "review_body": "Bought this to make a busy board for my baby so I wanted a good size and colorful one."},
{"rating": "4.0", "review_title": "great for those who can't see buttons well", "review_body": "calculator was a great gift for my almost blind mother"},
{"rating": "5.0", "review_title": "Makes doing the basics easy.", "review_body": "Big easy to press buttons and large size number read out.A little larger than a typical hand held calculator and there are no memory buttons."},
{"rating": "5.0", "review_title": "Love it! My desk is pretty serious", "review_body": "Love it! My desk is pretty serious, but this is a nice spot of color. Very reliable and keys have a satisfying click."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Nice little calculator.  Easy to read"},
{"rating": "1.0", "review_title": "Terrible product. This calculator had a dead battery when ...", "review_body": "Terrible product. This calculator had a dead battery when it arrived and a warning saying \" Don't try to replace this battery\"."},
{"rating": "5.0", "review_title": "Great product", "review_body": "Great product Wife loves it easy to read and use.  Great big keys and numbers."},
{"rating": "5.0", "review_title": "Nice calculator", "review_body": "Very nice calculator. Bright, large buttons and digits. Simple, easy to use. Battery and solar."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "no issues"},
{"rating": "5.0", "review_title": "Pretty pink product", "review_body": "I love the pink! It works very well. I'm a senior who appreciates the larger characters. Like the lighted information answers. If I needed another I would consider buying this one or recommend it to someone else."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "works well"},
{"rating": "5.0", "review_title": "his favorite color is blue and he especially likes the large", "review_body": "I purchased calculator for my grandson to use when he does his homework and he likes it very much....his favorite color is blue and he especially likes the large numbers"},
{"rating": "5.0", "review_title": "Purple princess", "review_body": "I love the color!  A perfect calculator for my desk!  I use it everyday!!!"},
{"rating": "3.0", "review_title": "Dead battery", "review_body": "Although this is a cute calculator for both of my daughters, one of them didn't work. I think the battery needs to be replaced which shouldn't happen if it's new."},
{"rating": "3.0", "review_title": "For Handheld Use Only.", "review_body": "It does the job it is supposed to do, but it is not very good as a desktop calculator. It is far too light, i.e. weight, and its base is too narrow. When you push any of the function buttons, on either side, the calculator tilts and almost flips over. On the plus side the display screen is large and easy to read."},
{"rating": "2.0", "review_title": "Not good value", "review_body": "While I was impressed with the price I should have looked further, no memory key and the worst part is the keys - difficult to press to register and unless careful and make note they do not register numbers at all.  I have to look for another calculator."},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "had to return, didn't work"},
{"rating": "5.0", "review_title": "Good Calculator for Girls", "review_body": "I bought this several months ago for my 7-year old.  It has held up very well and is priced just right.  She loves the pink color and the large buttons are great for smaller fingers."},
{"rating": "5.0", "review_title": "Just what I wanted", "review_body": "It's everything I wanted and was expecting. Love the pink color and the size is perfect. Easy to put away in my desk drawer but large enough to make it easy to use."},
{"rating": "3.0", "review_title": "Nice size", "review_body": "I like the size and the size of the buttons, but do not feel that the CE works very well. Have to hit several times or hit the clear/on."},
{"rating": "5.0", "review_title": "Purchased for husband. He appreciated large numbers and compact ...", "review_body": "Purchased for husband.  He appreciated large numbers and compact size."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Works well."},
{"rating": "5.0", "review_title": "Cool cal, my lil girl is in the 4th ...", "review_body": "Cool cal , my lil girl is in the 4th grade and she thinks it's good ."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "easy and good"},
{"rating": "5.0", "review_title": "Love the bright colors and the screen is easy to ...", "review_body": "Bought this calculator(and a green one) for work. Love the bright colors and the screen is easy to read. Affordable and shipped quickly."},
{"rating": "3.0", "review_title": "Look before U click", "review_body": "Kinda cheep - should have looked at closer - No memory function - Good for a kids toy - MY fault for not looking closer"},
{"rating": "3.0", "review_title": "I like the big buttons on it", "review_body": "Decent product for the price. I like the big buttons on it. The buttons are a little weird sometimes they get turned around but can be straightened out if you move them gently with your finger. The reason I bought this calculator is I loved the color!!!"},
{"rating": "5.0", "review_title": "Perfect Simple Calculator", "review_body": "I needed a simple non-scientific calculator for the GRE and this calculator fits the bill perfectly. I love the size of the keys and the easy to read display. Delivered exactly as promised. Would definitely buy from this vendor again."},
{"rating": "3.0", "review_title": "Ok", "review_body": "It's a standard, basic calculator. The solar power on mine doesn't seem to work very well as the numbers barely show up."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "This calculator is excellent because the numbers are big and the color is great. It really pops."},
{"rating": "4.0", "review_title": "Good all around calculator", "review_body": "Good all around calculator.  Weird layout and I can get tripped up by placement when in a hurry.  Larger buttons which I really like."},
{"rating": "1.0", "review_title": "This thing never worked cheat and not worth the money", "review_body": "This thing never worked cheat and not worth the money"},
{"rating": "5.0", "review_title": "Good Calculators", "review_body": "Great deal and will make useful gifts.  Big display is nice and the green is a fun color.  Thanks for a very good product!"},
{"rating": "5.0", "review_title": "I love the big numbers", "review_body": "This is cute!  I love the big numbers!"},
{"rating": "1.0", "review_title": "Piece of garbage. Only 1/2 of the numbers light up so ...", "review_body": "Piece of garbage.  Only 1/2 of the numbers light up so you can't tell what the numbers are.  My niece bought me one at Walmart for 50 cents and it works.  I am stuck with a nine dollar piece of garbage.  the number 9 looks like a 3.  on #5 you see the top and bottom of the number,blank in the middle.  does  not work .  i would like a refund."},
{"rating": "5.0", "review_title": "It works great with big numbers and clear screen", "review_body": "I bought this for my salon. It works great with big numbers and clear screen. I would recommend."},
{"rating": "5.0", "review_title": "They work great without any of the additional function on scientific calculators ...", "review_body": "what can I say, these calculators are as simple as they come, no bells and whistles. They work great without any of the additional function on scientific calculators most people don't know how to use or would ever have a use for. Great price and extremely fast delivery. I ordered on Tuesday night and received them by noon on Wednesday."},
{"rating": "5.0", "review_title": "Love the Color & Large Numbers", "review_body": "Purchased this for my 7 year old granddaughter who loves numbers & the color purple.  She loves it."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great numbers are big and Dias the job well"},
{"rating": "4.0", "review_title": "I like it", "review_body": "I like the color, it works don't really have any complaints."},
{"rating": "5.0", "review_title": "Great for Kids", "review_body": "Bought this my Grandson. It's his first. Easy to use for beginners"},
{"rating": "5.0", "review_title": "I like the large buttons and display", "review_body": "I like the large buttons and display.  Only had it a week or so, but works great for me.  Large enough so I don't have to search around for it, but small enough not to get in the way on my desk."},
{"rating": "5.0", "review_title": "Cool green", "review_body": "As expected with all my Amazon orders. Nice color and ready for Christmas wrapping"},
{"rating": "1.0", "review_title": "One Star", "review_body": "The keys were not easy to use, kept skipping and entry"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Excellent Product. Will recommend to others."},
{"rating": "4.0", "review_title": "Now King George can read it without his glasses", "review_body": "Now King George can read it without his glasses"},
{"rating": "3.0", "review_title": "Feels cheap but it works just fine", "review_body": "Feels like cheap construction and the screen feels very vulnerable, but if you're looking for a bunch of cheap calculators to put various places around the office it's perfect."},
{"rating": "5.0", "review_title": "Love it!!!!", "review_body": "This is exactly what I was looking for.  A simple , no nonsense calculator that my old eyes can see.  It takes up little room on my desk.  Can't praise it enough. Lilly Rasco"},
{"rating": "5.0", "review_title": "Best Calculator for Young Kids--and Many Adults", "review_body": "I purchased four of these calculators, three in green for my young nephews so they could \"play\" with them to memorize their math \"facts\" 0 thru 9."},
{"rating": "3.0", "review_title": "... to use it much but it appears to work fine. I needed something big enough to find in ...", "review_body": "I have not had time to use it much but it appears to work fine.  I needed something big enough to find in a pile of papers yet not break the bank.  And, my favorite color is blue."},
{"rating": "5.0", "review_title": "I like it duel power", "review_body": "Our granddaughter needed a basic calculator required at school, she wanted a cute one, 4th grader. I bought two different calculators from Amazon, we had three basics at the home. We let her choose which model she wanted, she chose this one. I like it duel power, bigger keys, nice."},
{"rating": "5.0", "review_title": "works great without too many distractions", "review_body": "purchased to use for school. works great without too many distractions."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "works good"},
{"rating": "2.0", "review_title": "The calculator works but is very cheaply made. The ...", "review_body": "The calculator works but is very cheaply made. The edges are rough and the buttons are clunky. Naturally the price was very cheap so I understand the adage \"you get what you pay for.\" I would not purchase this calculator again."},
{"rating": "4.0", "review_title": "2 + 2 = 5", "review_body": "Economically gets the job done, seems to work fine so far, no complaints!"},
{"rating": "1.0", "review_title": "This is a crappy little calculator", "review_body": "This is a crappy little calculator. It's so light that when you punch the keys it wobbles. I guess you get what you pay for."},
{"rating": "2.0", "review_title": "Would be great except for a performance issue/design flaw", "review_body": "I'm disappointed to have a negative review for this calculator, because I like the color and big buttons -- it's great except for one flaw that ruins it for me. The tilt of the display is either too much or not enough (not sure which), and as a result I literally cannot see the numbers when the calculator is flat on my desk, which means I have to hold it to do calculations. If I'm going to do that, I might as well use my iPhone. Very disappointed to have a design flaw ruin an otherwise great calculator."},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "Basic and large calculator."},
{"rating": "5.0", "review_title": "I'd buy it again", "review_body": "Didn't know it's disposable, but hey...great price...product...fast shipping. Well worth it."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Buttons don't push down as easily as I'd like but it's fun and cute and does the job"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Cute but big"},
{"rating": "4.0", "review_title": "Not rocket science, it's a calculator!", "review_body": "A little wobble when you press keys on the outer edge, but it's certainly not a big deal. The calculator does what it was promised to do and I like it!"},
{"rating": "5.0", "review_title": "Solor Calc", "review_body": "Great size, shape and color!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "works as it should"},
{"rating": "5.0", "review_title": "A bargain!", "review_body": "This is a very basic calculator which is what is required for my accounting class.  No bells or whistles.  It's more than acceptable and quite the bargain at this price.  I recommend the product to anyone looking for a basic calculator.  The vibrant green color is a bonus."},
{"rating": "1.0", "review_title": "Cheap piece of garbage. Do not buy this", "review_body": "Does not work.  Would not turn on.  Cheap piece of garbage.  Do not buy this."},
{"rating": "5.0", "review_title": "Bright color and easy to spot on desk", "review_body": "Works well.  Bright color and easy to spot on desk."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "LOVE the pink color! Great price!"},
{"rating": "3.0", "review_title": "Maybe you get what you pay for", "review_body": "The keys stick a little bit and it just feels a little chintzy...  maybe you get what you pay for."},
{"rating": "2.0", "review_title": "Breaks too easily!!", "review_body": "First time it was dropped on my desk the screen turned black.  Breaks too easily!!"},
{"rating": "5.0", "review_title": "... for my granddaughter to assist her in school she loved it. And purple is her favorite", "review_body": "bought it for my granddaughter to assist her in school  she loved it. And purple is her favorite color"},
{"rating": "4.0", "review_title": "Perfect little calculate with a great big number display!", "review_body": "This is great little calculator, nothing complicated does what it needs to do for me and it's light weight.  The color is exactly as it appears online and the large number display is perfect when I don't have my glasses at hand.  I can see them clearly.  Definitely worth the price. L"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "It works."},
{"rating": "2.0", "review_title": "Really cute but very cheaply made. A screw is ...", "review_body": "Really cute but very cheaply made. A screw is already coming off the back and made with very cheap plastic. The cute value is the only reason it's getting 2 stars."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "it worksfine"},
{"rating": "5.0", "review_title": "Pretty simple calculator", "review_body": "Pretty simple calculator ... simple, yet PERFECT for use on my desk at home and in the office ... everyone needs one!"},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "it looks nice but not well made."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "works like a charm and is the perfect size for work, never have any problems with it"},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "The buttons stick sometimes, it's adequate for the price and checking 4th grade math answers."},
{"rating": "5.0", "review_title": "Good size and pretty basic", "review_body": "Bought for my 6 year old granddaughter who is just starting to learn math.  Good size and pretty basic.  Just what she needs."},
{"rating": "5.0", "review_title": "Works great!", "review_body": "Works great and love that it has a -/+ button and a square root button. Does get a little bit noisy when in a quiet room but it's not bad, it's pretty, efficient, and a great working calculator. Will definitely purchase again when needed."},
{"rating": "5.0", "review_title": "It has large numbers and a large screen which makes it easy for her to use", "review_body": "I purchased it for my daughter (4th grade) who loves pink.  It has large numbers and a large screen which makes it easy for her to use."},
{"rating": "4.0", "review_title": "EASY DOES IT !", "review_body": "Nice, large calculator for basic functions !! ...large numbers, too !"},
{"rating": "5.0", "review_title": "i love the big numbers that are easy to push and ...", "review_body": "i love the big numbers that are easy to push and it will help us be more accurate with counting our end of night till."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "perfect"},
{"rating": "5.0", "review_title": "Avalon 8 Digit Dual Powered Desktop Calculator", "review_body": "It does math great. The nice thing is... that it takes my son's abuse at school."},
{"rating": "5.0", "review_title": "... year old mother - she loves it with big easy to read display and large keys", "review_body": "bought it for my 86 year old mother - she loves it with big easy to read display and large keys."},
{"rating": "5.0", "review_title": "good day-to-day calculator", "review_body": "I have only used the calculator a couple of times but it works fine. Nice bright green body and good screen illumination. The simple design is perfect for day-to-day use. And it's held up well to my little boys' shenanigans."},
{"rating": "4.0", "review_title": "Now King George can read this without his glasses", "review_body": "Now King George can read this without his glasses"},
{"rating": "4.0", "review_title": "Functional but flimsy", "review_body": "Functional but flimsy. Worked great until it got smashed falling off a table."},
{"rating": "5.0", "review_title": "Nice Gift", "review_body": "Grand Daughter loves this."},
{"rating": "1.0", "review_title": "One Star", "review_body": "it did not work and I threw it away"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "great"},
{"rating": "4.0", "review_title": "BIGGGG calculator", "review_body": "This thing is HUGE."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "super great looking.  daughter wanted it for work!"},
{"rating": "3.0", "review_title": "ok", "review_body": "does the job the kids use it all the time"},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "Cheaply but it does work"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Large size makes it easy for kids to use"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "I bought this for my sister and she loved it.  Works well and is easy to read."},
{"rating": "5.0", "review_title": "Simple", "review_body": "Simple"},
{"rating": "5.0", "review_title": "Simple", "review_body": "Simple"},
{"rating": "2.0", "review_title": "Also did not like the fact that the read-out could not be moved", "review_body": "Didn't last 3 months!  The keys began to stick, and it would not key-click reliably.  Also did not like the fact that the read-out could not be moved, so it was a pain to keep repositioning it under the desk lamp w/o glare on the screen."},
{"rating": "5.0", "review_title": "Love it", "review_body": "Works great, keys easy to press, has good functions."},
{"rating": "5.0", "review_title": "Excellent color choices!", "review_body": "I bought this in obnoxious green because it is easy to find, and it works perfectly!"},
{"rating": "5.0", "review_title": "It got here in great shape, and it does the job really well", "review_body": "I'm 65, and ordered this calculator for doing my checkbook balancing. It got here in great shape, and it does the job really well."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "good size for vision impared"},
{"rating": "2.0", "review_title": "The buttons, while large, are hard to press ...", "review_body": "The buttons, while large, are hard to press, so unless you really press down hard the numbers won't work.  Would not buy again, but hoping I can work with this one, cuz who needs multiple calculators lying around?"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "cute works good"},
{"rating": "1.0", "review_title": "Doesn't work most of the time", "review_body": "None of them work properly.  They look nice out of the box but everyone of them has a problem.  Buttons do not function all the time.  I recommend not purchasing these at all!!!"},
{"rating": "2.0", "review_title": "Looks good, doesn't work for long.", "review_body": "Worked well for awhile, but stopped working after 3 months of use. It only turns off and on, and displays \"0\" -- nothing else. Our last calculator lasted over seven years, this one barely made 90 days."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Good"},
{"rating": "3.0", "review_title": "LOVE the big buttons but it doesn't stay put - ...", "review_body": "LOVE the big buttons but it doesn't stay put - when entering numbers it doesn't stay put on the table. Have to hold it down."},
{"rating": "5.0", "review_title": "Calculator that works like every other calculator", "review_body": "Calculator works like a calculator. Surprise it adds and stuff. You'll never mess up basic math again. I've bought so many bad calculators from other places...don't make the mistake I did. Buy your weird green colored calculator here."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Nice size for desktop.  Easy to read numbers."},
{"rating": "5.0", "review_title": "good", "review_body": "very good, this was a replacement, but it works great"},
{"rating": "4.0", "review_title": "It works as described", "review_body": "Fun color an works.  A++"},
{"rating": "4.0", "review_title": "Nice!", "review_body": "Does it's job. Love love love the color! Can't complain."},
{"rating": "1.0", "review_title": "Never turned on. This one lacked an opening to ...", "review_body": "Never turned on.  This one lacked an opening to change the battery.  The pink one I bought had an access.  I tried to open the case to check the battery and the whole thing fell apart so obviously I can return it."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "absolutely love this I will be ordering another one for work.."},
{"rating": "5.0", "review_title": "So far so good. Nice large numbers and accurate calculator", "review_body": "So far so good.  Nice large numbers and accurate calculator."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Very nice style"},
{"rating": "5.0", "review_title": "Great simple calculator", "review_body": "Great calculator! Easy to use and slim enough to store in tight places. Fast shipping was also a plus as i needed it for an exam!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Perfect!"},
{"rating": "5.0", "review_title": "Got here on time and works great. The keys are very responsive", "review_body": "Got here on time and works great. The keys are very responsive. Bought it for my daughter as a replacement for the one she had that the cat threw up on. She's gonna keep this one up on the shelf. I'd buy it again"},
{"rating": "1.0", "review_title": "It worked great for the week we had it", "review_body": "It worked great for the week we had it. I dropped it on accident and it shattered the screen. Would not buy again."},
{"rating": "1.0", "review_title": "Poor Quality", "review_body": "Poor quality - only the bottom half of numbers show up, can't replace battery. I am returning to buy something else."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Glad i trusted the reviews.  works great, easy to read."},
{"rating": "5.0", "review_title": "Had to Have It!", "review_body": "We've enjoyed these calculators for years and when my wife saw the purple one - she just had to have it!  Works great!"},
{"rating": "1.0", "review_title": "BAD", "review_body": "Does not work."},
{"rating": "5.0", "review_title": "Worth it", "review_body": "Good, worth the money"},
{"rating": "5.0", "review_title": "Great for seniors", "review_body": "Picked it for color and ease for senior citizen who just wanted to do a few budget calculations."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Exactly as described. Exactly what I was looking for, a simple calculator with large buttons."},
{"rating": "5.0", "review_title": "Great", "review_body": "Big numbers and symbols for my grandson to use."},
{"rating": "1.0", "review_title": "This calculator works, but it just feels cheap. ...", "review_body": "This calculator works, but it just feels cheap.  There are times that I have to re-calcuate things because I either didn't press the button hard enough to enter the numbers, or the buttons were temperamental.  I would not buy this again.  :("},
{"rating": "5.0", "review_title": "Great calculator", "review_body": "Love this calculator,actually bought 2. The keys are big and you can see all the functions. Well worth the price"},
{"rating": "5.0", "review_title": "I bought this because my granddaughter's favorite color is pink and she loves it", "review_body": "I bought this because my granddaughter's favorite color is pink and she loves it!  She is in second grade and just beginning to learn how to use a calculator and this had all the functions she needed."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "adorable,,,,,good big numbers...arrived quickly..ncely package.  im very pleased."},
{"rating": "5.0", "review_title": "Calculator", "review_body": "This product works perfectly. Large buttons so I don't have to use my reading glasses."},
{"rating": "2.0", "review_title": "Not worth any money", "review_body": "It worked for about two month and then barely worked. You also have to press hard to get the buttons to work"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Big and can't turn off"},
{"rating": "1.0", "review_title": "Piece of crap!", "review_body": "Product was defective. And couldn't have been more cheaply made.  I returned it"},
{"rating": "1.0", "review_title": "One Star", "review_body": "returned since the keys did not work very well."},
{"rating": "1.0", "review_title": "Don't balance checkbook with this one!!", "review_body": "Wrong calculations. So sad when I try to teach my son something and calculator shows 36/7=9.14.....  It's like it rounds to as many digits as it'll hold but highest digit is always wrong. Ugh!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Just what I needed"},
{"rating": "3.0", "review_title": "Would be better for at home use vs school use", "review_body": "This was too big for my 7th grader.  Would be better for at home use vs school use."},
{"rating": "5.0", "review_title": "Fun for kids", "review_body": "My calculator obsessed 7 year old loves this. It's simple to use and is nice and large."},
{"rating": "5.0", "review_title": "a perfect machine for the job...", "review_body": "terrific llittle calculator. perfect for the mathematically \"unadept\" who just need to add and subtract and don't need the confusion of lots of butons. it doesn't do a whole lot, but it does it perfectly!!  and in a sze big enough to see..."},
{"rating": "5.0", "review_title": "great item", "review_body": "Great basic calculator. Love the colors they come in!! Very fast shipping and packaged well"},
{"rating": "5.0", "review_title": "Easy to see and use!", "review_body": "Perfect! Large buttons and display. Easy to use and enough to place them where I need them! Makes checking kids math homework a snap. Lightweight!"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Great color, works well"},
{"rating": "5.0", "review_title": "True Blue", "review_body": "great price"},
{"rating": "5.0", "review_title": "Large display and keypad", "review_body": "Great value for a great product!  Exactly as described.  Fast shipping."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "very good!"},
{"rating": "5.0", "review_title": "Great Value", "review_body": "Works wonderfully and great price!"},
{"rating": "1.0", "review_title": "BUTTONS STICK.", "review_body": "THIS ONLY WORKS PART TIME. I WORK FULL TIME SO YOU SEE THE ISSUE."},
{"rating": "5.0", "review_title": "Shipping was fast. Product was as described by seller ...", "review_body": "Shipping was fast.  Product was as described by seller.  The was a gift for a child and she loves it."},
{"rating": "5.0", "review_title": "It Works............", "review_body": "It works as expected."},
{"rating": "5.0", "review_title": "Love my little purple calculator", "review_body": "Love my little purple calculator! Great price and very fast shipping! Just right for my tiny desk. Nice big numbers for my old eyes too!"},
{"rating": "1.0", "review_title": "Wouldn't turn on", "review_body": "Out of the package it didn't even turn on. I ordered it for a student with special needs. I was very excited about the large buttons, angled display screen and cute color that I knew my student with visual impairment would love. Unfortunately, we had to return it before even getting to use it."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Love the size and the color"},
{"rating": "5.0", "review_title": "Great product.", "review_body": "This is a great basic calculator and works well. I was pleased to find it at Amazon"},
{"rating": "5.0", "review_title": "Calculator", "review_body": "Great Product - Thank You!!"},
{"rating": "2.0", "review_title": "Cheap plastic calculator", "review_body": "Worth maybe $1 or $2. The buttons stick sometimes. It serves its purpose, but I've seen better quality calculators for far less at the dollar store."},
{"rating": "5.0", "review_title": "Nice Easy Read Display", "review_body": "Arrived on time and works great with a nice big readable display."},
{"rating": "4.0", "review_title": "Perfect for those quick calculations", "review_body": "Exactly what you expect"},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "Good for kids, but not home office. The keys stick quite a bit."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Excellent"},
{"rating": "1.0", "review_title": "Buttons just stopped working", "review_body": "Thumbs down. Two of the buttons (numbers 1, 2 and 3) stopped working after a month and now time has passed for me to return it. :("},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Very simple to use and useful to my 99-year old mother."},
{"rating": "5.0", "review_title": "Happy Person", "review_body": "Great color and is nice and simple which is the intended goal."},
{"rating": "5.0", "review_title": "Love it!!", "review_body": "Great value."},
{"rating": "5.0", "review_title": "Purchase", "review_body": "Good"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Good produce as a great price."},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "They are okay"},
{"rating": "5.0", "review_title": "Avolon 8 digit calculator", "review_body": "very good calculator does what I need done."},
{"rating": "5.0", "review_title": "Love it! Exactly what I wanted", "review_body": "Love it!  Exactly what I wanted.  It matches the other pink items on my desk perfectly."},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "A lot larger then I thought it would be but works well."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "great price"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "It's exactly what I needed.  THX!!!"},
{"rating": "5.0", "review_title": "GOOD!", "review_body": "A lot bigger than i expected but it does work very well. It is easy to use and it has big numbers to read. If you want a simple calculator here it is."},
{"rating": "5.0", "review_title": "Easy to use and see", "review_body": "Purchased for grand daughter.  Easy to use and see.  I ended up ordering one for myself."},
{"rating": "1.0", "review_title": "very disappointed.", "review_body": "Dollar store quality that you pay a fortune for.  Very, very disappointed."},
{"rating": "5.0", "review_title": "Perfect for a child", "review_body": "Perfect training calculator for my preschooler.  He loves the vibrant color, large display and numbers.  Buttons are easy to press and calculator is lightweight."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Hubby can never find a calculator when he needs one so I ordered the 6pk."},
{"rating": "5.0", "review_title": "easy", "review_body": "perfect for simple needs"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "LOVE IT"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Perfect for our special needs students - easy to use, easy to read, and they love green."},
{"rating": "5.0", "review_title": "Very nice calculator", "review_body": "My wife loves this! And so do I. The display and keyboard are large enough for our eye's!"},
{"rating": "5.0", "review_title": "Kids love them", "review_body": "Fun way to practice math and get the kids familiar with numbers."},
{"rating": "4.0", "review_title": "Good product", "review_body": "Good product. Arrived on time"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great size numbers, love the solar."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "great"},
{"rating": "2.0", "review_title": "When I press the right or left most buttons the entire calculator wobbles making math not so much fun..", "review_body": "While you get what you pay for, this calculator needs to have a more stable base.  When I press the right or left most buttons the entire calculator wobbles making math not so much fun..."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Perfect."},
{"rating": "5.0", "review_title": "nice!", "review_body": "it works, is pink: nice !"},
{"rating": "5.0", "review_title": "Sweet little green.", "review_body": "The buttons are large and spaced far apart so that errors are minimized and the bright color means that you can find it when you need it in a pile of papers or a bag-I use it for college work. It is easy to use so you don't and the directions are not wordy or vague."},
{"rating": "4.0", "review_title": "All O.K.", "review_body": "Does everything that it's supposed to do. No problems."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great, simple and inexpensive"},
{"rating": "5.0", "review_title": "Nice Calculator", "review_body": "Love the large key size - it's easy to read."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great little calculators."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Worked pretty well"},
{"rating": "1.0", "review_title": "One Star", "review_body": "The #7 button doesn't work."},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "Worked for a very short time."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "VERY NICE FANCY LOOK GREAT IN GENERAL"},
{"rating": "5.0", "review_title": "Just what I wanted", "review_body": "I don't have time to find my calculated app on my phone. I can easily find my green desk top calculator! easy to read and use."},
{"rating": "5.0", "review_title": "Perfect", "review_body": "Just what I needed.  Large numbers,  large buttons,  but not a big calculator.  Works great."},
{"rating": "5.0", "review_title": "Nice", "review_body": "Very nice sturdy calculator.  The numbers are easy to see and the buttons are a good size."},
{"rating": "1.0", "review_title": "One Star", "review_body": "One flicker and then it died forever"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Excellent"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Good, large read out."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Simple and easy to use. Holds up well to daily use."},
{"rating": "5.0", "review_title": "I'[m well pleased with this calculator", "review_body": "So far, I'[m well pleased with this calculator."},
{"rating": "5.0", "review_title": "Perfect for the job....", "review_body": "Great little unit. Buttons function smoothly. Although could be used as a desktop calculator is small enough to fit in hand for quick functioning. Large buttons and big screen a bonus. Thanks for speedy shipping!"},
{"rating": "5.0", "review_title": "I'm happy with it", "review_body": "It's a calculator. It works. I'm happy with it."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "One the best calculators I have ever owned!!!"},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "wont work without light penetrating"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "It works, hope it lasts a while."},
{"rating": "5.0", "review_title": "Great little (big) calculator", "review_body": "Great little (big) calculator.  Easy to press numbers, don't need my glasses to see the numbers.  Does everything I know how to do on a calculator and even does percentages without my old weird formula.  Would buy this again."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "GREAT"},
{"rating": "5.0", "review_title": "Beautiful color, nice big", "review_body": "Beautiful color, nice big, easy to use numbers and goes great with all my new purple desk supplies.  A must have for a purple lover.  Great buy!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great calculator"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Good size."},
{"rating": "1.0", "review_title": "Cute calculator for grandson, too bad it doesn't work.", "review_body": "Doesn't even deserve one star--has never turned on since it arrived.  I put it next to a window for a day in case the solar battery needed to charge, still nothing.  Don't waste your money."},
{"rating": "3.0", "review_title": "Just barely OK.", "review_body": "Just ok. I don't really like the way the buttons push down kind of sideways. Maybe this is because they are large, but it is ready for it top happen and not realize it didn't register."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "dirt cheap easy to read"},
{"rating": "1.0", "review_title": "Boo!", "review_body": "pretty terrible. buttons don't all work. Don't buy this."},
{"rating": "5.0", "review_title": "Perfect for simple", "review_body": "Simple and stylish. Buttons are hard plastic, but with a matte finish that is pleasing to the fingertips. Perfect for simple, everyday calculations."},
{"rating": "5.0", "review_title": "Cute purple calculator", "review_body": "Beautiful color, big numbers, reasonably priced. Good buy."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "If you don't like big, this is NOT for you!"},
{"rating": "1.0", "review_title": "Frustrated-- hit or miss item", "review_body": "I ordered two of these calculators.  One works; the other never worked.  I emailed the company twice about this and never heard from them."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "As described."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Good calculator.  Received promptly.  100% satisfied with this purchase."},
{"rating": "1.0", "review_title": "One Star", "review_body": "The products bottom buttons don't work"},
{"rating": "5.0", "review_title": "Calculator", "review_body": "Calculator, light weight, works great"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Super cute and the most beautiful purple color. Love it !!!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Pretty good!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great calculator! Works perfectly. The size is perfect for a desk. Plus who doesn't like purple??"},
{"rating": "5.0", "review_title": "Enjoyable calculator!", "review_body": "Good price - fun product - large and easy to use numbers. Would buy again."},
{"rating": "5.0", "review_title": "I have not really used it yet but love the purple colo", "review_body": "I have not really used it yet but love the purple colo. The size is perfect for my smaller desk and the numbers are larger making it easier to see."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "as described"},
{"rating": "3.0", "review_title": "would have been nice", "review_body": "it was nice and big but the battery in the back it came with would not hold a charge, the screen was illegible"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Works great 4 such a nice little price. Like the color."},
{"rating": "1.0", "review_title": "Cute and Defective", "review_body": "Cute looking object but the buttons don't have the right \"clicking\" feel that makes a large calculator useful.  On top of that, the 2 and 5 buttons didn't work at all!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Works great, simple, not expensive."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Lightweight and good key action. 55378008"},
{"rating": "5.0", "review_title": "Great calculator", "review_body": "Great calculator for an awesome price."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Very simple, large LCD, very cheap"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "I use this at work and love it"},
{"rating": "1.0", "review_title": "Drains battery.", "review_body": "Use this for 3 months, had to change the AG10 battery 3 times already."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Nice calculator, it serves its purpose and color is really nice. I recommend it. Thanks!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "what a good deal."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Product was shipped in a timely fashion and works well."},
{"rating": "5.0", "review_title": "Kids love this calculator", "review_body": "Nice little calculator. Lightweight and colorful. Works with battery and solar power. My kids like it."},
{"rating": "5.0", "review_title": "this is exactly what I wanted and it works great!!", "review_body": "this is exactly what I wanted and it works great!!!  the colour is a perfect match for all my other office accessories and its very user friendly!!!"},
{"rating": "5.0", "review_title": "Perfect basic calculator", "review_body": "This is for my 5 year old.  He loves it. The numbers are large for his little hands."},
{"rating": "5.0", "review_title": "Solid Calculator", "review_body": "I've had this for a couple weeks now and haven't had any problems. I like the color, the buttons are the purest size and it turns off on its own. No complaints."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great product. Fast Delivery."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "good calculator for small work"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "good for price"},
{"rating": "5.0", "review_title": "Just a great stapler", "review_body": "great product"},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "bad keyboard layout, but works well"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "perfect size (and colors!) for my kids - they love it."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great size! Easy for eyes that are getting older"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "This is very pretty. Easy to operate and read. Would buy again."},
{"rating": "5.0", "review_title": "I may need more colors. :)", "review_body": "Great.  Does what I need.  Inexpensive.  It doesn't get lost on my desk. :)"},
{"rating": "1.0", "review_title": "One Star", "review_body": "The battery was corroded."},
{"rating": "5.0", "review_title": "thanks", "review_body": "love it"},
{"rating": "4.0", "review_title": "Big and helped me pass the Ohio real estate exam", "review_body": "Very satisfied"},
{"rating": "5.0", "review_title": "Fantastic large display and the perfect colour", "review_body": "I bought it for my wife and she loves it. Fantastic large display and the perfect colour!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Bought for shop use and they seem to work fine."},
{"rating": "1.0", "review_title": "One Star", "review_body": "Do not order - they do not work properly"},
{"rating": "4.0", "review_title": "Sylish numbers.", "review_body": "It's Green and it keeps count!!!"},
{"rating": "5.0", "review_title": "awesome", "review_body": "very light and function very good .. I like it"},
{"rating": "4.0", "review_title": "GREAT VALUE", "review_body": "It was a great value for the price. The large keys and display is great for a senior like me with poor eye sight. And never having to worry about replacing batteries is a plus."},
{"rating": "3.0", "review_title": "good", "review_body": "works well but I prefer the screen showing the numbers to have an option to extend a bit so it's easier to read the screen when you're sitting low at a desk"},
{"rating": "1.0", "review_title": "Broken after only one use!", "review_body": "I bought this and only used it once... Second time I tried to use it the plus button no longer worked.  I had to buy another calculator for school."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Very easy to use."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Nice size. Not to big nor small."},
{"rating": "1.0", "review_title": "One Star", "review_body": "Do not order - they do not work properly"},
{"rating": "2.0", "review_title": "only 2 stars and only gave that bc it arrived on time", "review_body": "cheap product would not buy again"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "works well!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "perfect for simple calculating. Great color!"},
{"rating": "5.0", "review_title": "The buttons are large-- Just as I wanted.", "review_body": "The buttons are large-- Just as I wanted."},
{"rating": "5.0", "review_title": "Love it, love the color", "review_body": "I use this calculator every single day. Love it, love the color."},
{"rating": "5.0", "review_title": "Love it", "review_body": "Very cute but kinda small.  Works breat"},
{"rating": "5.0", "review_title": "Perfect", "review_body": "Large display. Easy to read."},
{"rating": "4.0", "review_title": "Nice size but just ok buttons", "review_body": "not the most comfortable buttons but it works"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "nice calculator, gets the job done with no issues"},
{"rating": "5.0", "review_title": "Great.", "review_body": "Use this at work all the time. Great."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "I love the big numbers and the color."},
{"rating": "5.0", "review_title": "Works great and helps her check her math problems", "review_body": "My daughter is a purple freak and loves this calculator. She keeps it on her desk in her \"purple\" room. Works great and helps her check her math problems."},
{"rating": "5.0", "review_title": "they come in such great colors!", "review_body": "These calculators are exactly what we needed.... and bonus, they come in such great colors!!"},
{"rating": "5.0", "review_title": "Great 1st calculator", "review_body": "I purchased this for my granddaughter to use in her 6th grade classes. It's her 1st calculator and she loves it."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "My granddaughter's age's 5 & 7 are really enjoying them. Helping them learn mathematics."},
{"rating": "1.0", "review_title": "These look like they've been used for a long time", "review_body": "These look like they've been used for a long time. Tons of scratches. They came in sealed packages, but there is definitely some wear and tear."},
{"rating": "5.0", "review_title": "Exactly what I needed!", "review_body": "My old calculator, which I had more than 15 years, did a lot more than this calculator, but I never used half the functions. When it finally died -- battery changes no longer helped -- I looked for something simpler and found this."},
{"rating": "1.0", "review_title": "Don't buy it", "review_body": "Buttons stopped working after a few months of very limited use."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Perfect!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Perfect sized calculator. It works well for it's purpose."},
{"rating": "5.0", "review_title": "Big buttons!", "review_body": "Giant Calculator, any questions?"},
{"rating": "5.0", "review_title": "Nice and Big", "review_body": "easy to see. easy to use."},
{"rating": "4.0", "review_title": "easy to find in the desk clutter being bright green", "review_body": "big buttons and screen for the ocular impaired. buttons seem a little cheap so we will see how long it lasts. easy to find in the desk clutter being bright green. Using it for helping with home schooling."},
{"rating": "3.0", "review_title": "All else is good.", "review_body": "Difficult to see the decimal point because it's placement is so low down at the bottom. Almost missed it a couple times. I didn't use this to take the math test I bought it for because I was worried that I mught miss seeing the decimal point. All else is good."},
{"rating": "3.0", "review_title": "One didn't work", "review_body": "Excellent size, but one of the calculators in the package did not work.  Not sure about quality testing."},
{"rating": "5.0", "review_title": "Love it!", "review_body": "I love the color and the big buttons on this calculator.  Easy to use and brightens up my desk."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "great"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Easy to use, compact, and I love the fact that it can be solar-powered!"},
{"rating": "1.0", "review_title": "One Star", "review_body": "Do not order - they do not work properly"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "My stepdaughter likes her Christmas gift a lot"},
{"rating": "5.0", "review_title": "Good buy.", "review_body": "Totally works for basic calculator decent quality!!  Good buy."},
{"rating": "4.0", "review_title": "Functional", "review_body": "The equal = button is in a strange position. Takes an adjustment. Works great as needed"},
{"rating": "5.0", "review_title": "Large display and easy to read", "review_body": "If you need a basic calculator this is the one.  Large display and easy to read.  The buttons are large and have a nice \"feel\".  Note it does not have a memory function that many other basic calculators have, but that is not an issue for my situation."},
{"rating": "3.0", "review_title": "there was an \"M\" on the screen like you would see on a calculator with memory function", "review_body": "cheap calculator, feels light and poorly made.  Sometimes, the numbers pressed do not show up on the screen, and I have to repress. Also, when the calculator arrived, there was an \"M\" on the screen like you would see on a calculator with memory function.  This one does not have that, and I could not get the M to go away that day.  I let the calculator rest, and the M has since disappeared.  I like the pink color, so am keeping it, but would not buy this again for the price.  I got a cheaper calculator from Staples ($5) and it is of better quality - it's just not pink."},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "I thought it would be bigger."},
{"rating": "1.0", "review_title": "Total crap. Glitched out and died on me in the ...", "review_body": "Total crap. Glitched out and died on me in the middle of my Statistics exam two days after buying it. Total junk. Don't bother buying it."},
{"rating": "5.0", "review_title": "You can't go wrong", "review_body": "It's everything that you may want in a nice little calculator.  Nice looking buttons with a nice feel."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "my office is dark so this exactly what I needed!"},
{"rating": "1.0", "review_title": "Does not travel well", "review_body": "Broke just after 2 days in my daughters back pack"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "It came perfectly and it is better than excepting."},
{"rating": "5.0", "review_title": "Nice", "review_body": "Nice"},
{"rating": "1.0", "review_title": "One Star", "review_body": "not a good quality product"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great calculator...love the fun color."},
{"rating": "1.0", "review_title": "One Star", "review_body": "Not happy used a few times and it's dead. Too much hassle to return it."},
{"rating": "1.0", "review_title": "Junk!", "review_body": "Do not buy these! They are complete junk. I bought 4 and the 2 that I opened had faulty screens and then didn't even turn on the next day. I returned all 4 that I ordered."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great calculator"},
{"rating": "4.0", "review_title": "Cheap, perfect size, good value", "review_body": "Excellent Calculator. Perfect for the nearsighted like myself or if you don't want your calculator to get lost in the clutter on your desk"},
{"rating": "1.0", "review_title": "One Star", "review_body": "Didn't work.  Returned it."},
{"rating": "5.0", "review_title": "Great calculator", "review_body": "Great calculator and super affordable and adorable.  I love it!  The purple is exactly as shown."},
{"rating": "4.0", "review_title": "This is a very practical calculator. Can fit in ...", "review_body": "This is a very practical calculator. Can fit in my handbag and the numbers are easier to use that the calculator on my phone."},
{"rating": "4.0", "review_title": "It was exactly what was expected and it works great. It's a very basic calculator with good size ...", "review_body": "It was exactly what was expected and it works great.  It's a very basic calculator with good size buttons and an easy to read display without my glasses.  Thanks!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Ready for 4th grade with her perfectly purple calculator."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "What's not to like?"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "big buttons and works perfectly!! thank you"},
{"rating": "1.0", "review_title": "This calculator is unsteady. Anytime you press a button ...", "review_body": "This calculator is unsteady. Anytime you press a button that is along the edge, it tips sideways! The screen stopped displaying properly and now it cracked!"},
{"rating": "5.0", "review_title": "great for the office", "review_body": "Big buttons, bright color!"},
{"rating": "5.0", "review_title": "Great calculator for the right price!", "review_body": "Works great. Love the large number keys. I use this at work daily and highly recommend it."},
{"rating": "5.0", "review_title": "Works great! No batteries needed", "review_body": "Works great!  No batteries needed.  I have had this for four months now.  I have not had the first problem with the calculator."},
{"rating": "5.0", "review_title": "GOOD BUY good product", "review_body": "I got my order in 2 days no problems works ok I still can not believe you can get something that handy for in under $10.00 I would recommend to any one wanting a calculator I am a happy camper now."},
{"rating": "5.0", "review_title": "Good Calculator", "review_body": "No problems. Works fine. Big numbers, easy to read display, seems to do fine in low light. One drawback is no memory function. Very inexpensive."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "perfect for what I needed - due to the color they don't get lost on the counter"},
{"rating": "4.0", "review_title": "Good product", "review_body": "Exactly what I needed, came on time and worked with no problems."},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "The sellers got this out in a timely manner but 2 didn't work, and not impressed w the quality."},
{"rating": "5.0", "review_title": "Great size", "review_body": "Love it!"},
{"rating": "1.0", "review_title": "One Star", "review_body": "never worked properly so I threw it out after being a desk ornament for a few weeks."},
{"rating": "1.0", "review_title": "One Star", "review_body": "Sucks dont buy it if you need it for work to be done . Buttons are sticky"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great"},
{"rating": "4.0", "review_title": "I really liked all the color options", "review_body": "Just what I was looking for to keep  on my desk in my office at the house. I really liked all the color options too"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Nice calculator. Arrived very quickly"},
{"rating": "5.0", "review_title": "He loves how easy it is to use and that its a fun ...", "review_body": "I bought this for my nephew (5) for christmas and he wouldn't put it down! He loves how easy it is to use and that its a fun bright color!"},
{"rating": "5.0", "review_title": "Big, bold and without many buttons that don't do anything useful", "review_body": "Big, bold and without many buttons that don't do anything useful.  This is how I know when I have enough money to buy more things (like this calculator) on Amazon!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great calculator and color. It looks great on top of my personal desk at home. Good to use everyday."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Helpful!"},
{"rating": "1.0", "review_title": "One Star", "review_body": "Screen damaged and leaked within a week. 2nd one only lasted a month."},
{"rating": "2.0", "review_title": "but doesn't feel good in hand", "review_body": "It works, but doesn't feel good in hand; very poor quality product"},
{"rating": "5.0", "review_title": "Perfect for averaging grades without having to use my phone ...", "review_body": "This product arrived on time and exactly as described. Perfect for averaging grades without having to use my phone calculator, which is why I purchased it."},
{"rating": "2.0", "review_title": "Screen is good and easy to read but I broke a calculator ...", "review_body": "Quality is very low. Screen is good and easy to read but I broke a calculator every week. Look harder you will find something cheaper and better."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great product and a great deal."},
{"rating": "5.0", "review_title": "These are GREAT! The large buttons are PERFECT for my students ...", "review_body": "These are GREAT!  The large buttons are PERFECT for my students and they arrived in perfect time!"},
{"rating": "5.0", "review_title": "we all love it. It's fast", "review_body": "I bought this for work, because our boss loves pink...we all love it.  It's fast, the numbers are very easy to read and it's fun!"},
{"rating": "2.0", "review_title": "Not working after 1 week", "review_body": "Numbers stopped working after a week"},
{"rating": "5.0", "review_title": "Great product", "review_body": "Perfect exactly what I was looking for thank you"},
{"rating": "4.0", "review_title": "Light and slim", "review_body": "I haven't gotten to use it a lot but it seems to work well, is extremely light, and easily squeezes into my bag."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "this calculator arrived on time and works well just as advertized"},
{"rating": "5.0", "review_title": "Love the color", "review_body": "Big number keys, always ready to work."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Works fine. Large font. Easy to use!"},
{"rating": "4.0", "review_title": "big buttons", "review_body": "I like the oversized buttons, the silk screen print one one button is shadowed from 2 passes but still a nice calculator."},
{"rating": "5.0", "review_title": "Nicely sized, nicely priced", "review_body": "The calculator is a nice size, cute color and does the job. Definitely worth the money. I have one for my work and my son, who is 6, loves it too - so I had to buy a second one."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great product, just as described, fast delivery."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "My niece loves it"},
{"rating": "5.0", "review_title": "I would recommend this calculator.", "review_body": "This calculator works very good. The keys are bigger and easier to use. And it is well made."},
{"rating": "5.0", "review_title": "Works great! Easy to operate", "review_body": "Works great!  Easy to operate.  Wonderful color.  Exactly what I expected!!!"},
{"rating": "5.0", "review_title": "Simple daily calculator", "review_body": "Simple, large numbers for easy use, does its job just fine!"},
{"rating": "4.0", "review_title": "works great", "review_body": "It was a little smaller than I pictured but still very useful and works great."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "good for the kids daily"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Nice big numbers, Love it!!"},
{"rating": "4.0", "review_title": "Easy to read and easy to find on a cluttered ...", "review_body": "Just as portrayed, very high visibility as far as the calculator and the numbers.  Easy to read and easy to find on a cluttered desktop."},
{"rating": "5.0", "review_title": "Great product", "review_body": "Awesome product! Great functionality and quality construction for price. Very clear lcd screen, and works just the way you need it to."},
{"rating": "5.0", "review_title": "awesome", "review_body": "Great calculator! Quality is great - cute design."},
{"rating": "5.0", "review_title": "I don't want to have to focus to hard at reading the calculations its great.", "review_body": "A hit at the office. Big clear numbers. I work on the phones. I don't want to have to focus to hard at reading the calculations its great."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Can't beat it for the price."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "It is easy to read and operate. It is worth the price."},
{"rating": "3.0", "review_title": "When I press the icon, it always noisy. ...", "review_body": "When I press the icon, it always noisy. I hope it could be much more silent because i need to use it during quiz."},
{"rating": "5.0", "review_title": "Nice big numbers", "review_body": "Works as expected. Nice big numbers."},
{"rating": "5.0", "review_title": "Great basic calculator", "review_body": "I bought this for my 4th grade son and it is perfect. It's a good size for a 9 year old. And the buttons are simple and adequately sized. And the color options are all so cute. Great product!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "good quality and good price!"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "No off button"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "perfect"},
{"rating": "4.0", "review_title": "My girls love their new calculators", "review_body": "My girls love their new calculators! They play with them like they play with their Kindles. Math and fun rolled into one!"},
{"rating": "5.0", "review_title": "Perfect, simple calculator", "review_body": "Perfect, simple calculator.  Key are large and numbers are big so I don't have to find my readers to use this calculator."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "My daughter loves it especially the color."},
{"rating": "4.0", "review_title": "Fun Colors", "review_body": "I love the big easy-to-see buttons, but they tend to stick.  Colors are great"},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "The buttons do not respond to some touches."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "great product"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "The buttons are big and it works well."},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "Not very good. It wobbles when you strike the keys"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Nice calculator with big buttons. Easy to use."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Basic non programmable calculator. Keys are big enough."},
{"rating": "4.0", "review_title": "Great easy to read calculator.", "review_body": "Large numbers in a clear aspect so this older lady can read the results. Love this calculator."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "My granddaughter will love it."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Nice sized numbers and perfect for 6th grade homework!"},
{"rating": "5.0", "review_title": "Amazing Calculator", "review_body": "Amazing calculator.  Used it to do my taxes"},
{"rating": "4.0", "review_title": "Good calculator", "review_body": "A very useful item.  It's got a large screen with easy to use keys.  For the price it is a real deal!"},
{"rating": "3.0", "review_title": "Bigger than I thought", "review_body": "I thought calculator was smaller... I searched pocket size so I assumed it would be smaller and its normal size!!"},
{"rating": "1.0", "review_title": "junk...", "review_body": "Piece of junk. It wouldn't work when I received it."},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "I ordered two, one arrived broken"},
{"rating": "1.0", "review_title": "It is a junk! Not working at all Trash ...", "review_body": "It is a junk !"},
{"rating": "1.0", "review_title": "One Star", "review_body": "Product does not work correctly.  Buttons are not working"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "nice little calculator, and easy to find on my crowded desk."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "easy to operate"},
{"rating": "1.0", "review_title": "Bought it for a coworker because she wanted a pink ...", "review_body": "Bought it for a coworker because she wanted a pink calculator.  Didn't even last 2 months.  Money down the drain!"},
{"rating": "1.0", "review_title": "Horrible!!", "review_body": "Horrible!!!! The 2s look like a backwards 9 and the numbers are not displaying. Would love to return it but I already opened the package"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great!"},
{"rating": "4.0", "review_title": "Fun!", "review_body": "This calculator is a nice purple! It works well and adds a pop of color to the tappity tap of the calculator. #like"},
{"rating": "5.0", "review_title": "and also love the color", "review_body": "I have been using this every day since I got it, and also love the color."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Just what I was looking for.....Simple"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Ty"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Works great!"},
{"rating": "5.0", "review_title": "Great looking calculator", "review_body": "Have been enjoying the great looking purple calculator, and has come in handy when needed."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Exactly what I wanted."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Awesome!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great calculator for the office!  The bright colors are fun too :) very satisfied."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Its a big bright purple calculator that does what its suppose to..lol"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Looks great!  Thanks!"},
{"rating": "3.0", "review_title": "Sometimes display doesn't like up even when it gets light", "review_body": "It works just ok. Sometimes display doesn't like up even when it gets light."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Wonderful product, lightning fast shipping"},
{"rating": "4.0", "review_title": "easy to see function keys", "review_body": "Very simple calculator, easy to see function keys, would recommend it who needs a basic calculator."},
{"rating": "5.0", "review_title": "perfect small calculator", "review_body": "perfect for what i needed it for"},
{"rating": "2.0", "review_title": "Quality", "review_body": "The screen has dark spot in the corner."},
{"rating": "5.0", "review_title": "Great Calculator", "review_body": "I love this calculator. It's so colorful with large, easy to read buttons. Fun to use!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "It was inexpensive and served its purpose"},
{"rating": "4.0", "review_title": "... were purchased as a gift for children in a poor school district", "review_body": "They were purchased as a gift for children in a poor school district. Christmas gifts."},
{"rating": "3.0", "review_title": "Ok quality. Even thought it was packages it seemed ...", "review_body": "Ok quality. Even thought it was packages it seemed used. It had many scratches. But it does the job."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Perfect for students!"},
{"rating": "5.0", "review_title": "This is perfect. It's really lightweight", "review_body": "Needed a calculator with big buttons and a big display. This is perfect. It's really lightweight, easy to read. Glad I bought it."},
{"rating": "3.0", "review_title": "I like the big buttons and numbers", "review_body": "I like the big buttons and numbers, I am fumbling with where all the buttons are, but that will come later!"},
{"rating": "4.0", "review_title": "good", "review_body": "good"},
{"rating": "1.0", "review_title": "Too Wobbly To Be Any Use.", "review_body": "Feet are inset which makes this calculator wobbly."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Very nice. Large buttons and display!"},
{"rating": "5.0", "review_title": "Great basic calculator", "review_body": "calculator arrived when promised, works great, exactly what I wanted.  The big buttons make it fat fingerproof"},
{"rating": "5.0", "review_title": "Love it", "review_body": "Love it. Simple, attractive, no batteries to replace."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "I like it very much. Cute color, huge display"},
{"rating": "5.0", "review_title": "good basic calculator.", "review_body": "works well. fast delivery. would recommend if you need a basic calculator."},
{"rating": "5.0", "review_title": "This calculator is perfect for our office", "review_body": "This calculator is perfect for our office! It has all the needed buttons & calculations for everyday purposes. Good buy!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "works well"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Pretty good!"},
{"rating": "5.0", "review_title": "great product!", "review_body": "Fun blue color. Works great and display is easy to read. Large buttons are great for my big fingertips!!"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "good and reliable"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Bought for grandson to play with."},
{"rating": "2.0", "review_title": "Unsteady due to bottom rubber cushion feet in the wrong place", "review_body": "When you press the PLUS (+) key, due to the rubber feet too far in at the bottom, the right bottom side dips when you press the key and and the calculator jumps off the table when you lift the finger. Since I use the plus key in most of my calculations, this was quite annoying. Other than that no other issues. Had to toss it in the recycle."},
{"rating": "5.0", "review_title": "Great product for a great price", "review_body": "Works perfectly! My six-year-old son loves it"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "so far so good!! large size keyboard and screen a real PLUS"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Perfect size and color, works great."},
{"rating": "5.0", "review_title": "works great..", "review_body": "colorful, cheery calculator... works great...well worth the money!"},
{"rating": "5.0", "review_title": "So Cute", "review_body": "Perfect! Loooove the color!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "A-OK"},
{"rating": "1.0", "review_title": "One Star", "review_body": "Didn't work when I got it"},
{"rating": "5.0", "review_title": "Great item", "review_body": "My friend's daughters loved these -- I bought two, one pink one purple. Reasonably priced, speedy shipping. Thank you!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Perfectly described and delivered!"},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "Not bad, clunky buttons."},
{"rating": "5.0", "review_title": "Perfect if you love everything PINK!", "review_body": "Pretty pink color. Just as Pictured. I love it."},
{"rating": "1.0", "review_title": "One Star", "review_body": "only worked for a week before it died"},
{"rating": "1.0", "review_title": "do not waste ur money", "review_body": "Broke in one week. do not waste ur money."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Product was received on time and works great.  The numbers are nice and big for easy reading."},
{"rating": "5.0", "review_title": "It is a pretty color.", "review_body": "Bought as a gift.  It is a pretty color."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Just what I needed"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "actually got exactly what I wanted. Pink....."},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "The clear button doesn't work"},
{"rating": "5.0", "review_title": "Good calculator!", "review_body": "Good calculator!"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Product as described."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Good size, large numbers, easy to see and use."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Just what I was looking for!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great product & superb color!"},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "Feels flimsy"},
{"rating": "2.0", "review_title": "Bought two.. they take forever to start up ...", "review_body": "Bought two..they take forever to start up."},
{"rating": "1.0", "review_title": "This calculator doesn't work", "review_body": "Unfortunately this calculator looks good but it doesn't work. I will have to buy another one."},
{"rating": "1.0", "review_title": "Do not order!", "review_body": "The calculator does not turn on! Not worth the hassle of mailing it back so just a waste."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Very cute and functional! Double win! :)"},
{"rating": "5.0", "review_title": "Good calculator", "review_body": "I bought 3 of these for each of my kids.  They are easy to use, and I find myself borrowing them often."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great calculator"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Love it!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Calculator works just fine. It arrived on time with no complaints."},
{"rating": "5.0", "review_title": "Nice calculator. Love the color.", "review_body": "Works great"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "this here kalkulator is working just fine."},
{"rating": "1.0", "review_title": "Not worth the price.", "review_body": "Died within 2 weeks."},
{"rating": "1.0", "review_title": "One Star", "review_body": "It is broken before opening the pack"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "For my granddaughters"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "works great"},
{"rating": "5.0", "review_title": "Great inexpensive calculator. Works well.", "review_body": "Great inexpensive calculator. Works well."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Love it!! Perfect size..."},
{"rating": "4.0", "review_title": "I like it.", "review_body": "works great"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "I bought this for my six year old for a few bucks you can't go wrong."},
{"rating": "5.0", "review_title": "Great", "review_body": "Perfect for my 4th grader. Thank you"},
{"rating": "5.0", "review_title": "Good Quality", "review_body": "Item is of good quality and the size of the buttons are perfect for my daughter to use, she has CP."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great"},
{"rating": "5.0", "review_title": "Just what we needed", "review_body": "Fast shipping, great product, great color choice."},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "It serves the purpose but it's just OK.."},
{"rating": "1.0", "review_title": "Cheap", "review_body": "Broke first week"},
{"rating": "5.0", "review_title": "Great calculator for the price...", "review_body": "Works as expected; arrived on time; all good."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Worked perfectly for my CPP exam!"},
{"rating": "5.0", "review_title": "Fills the Bill", "review_body": "Compact in size, but nice large keys.  Easy to use."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Love the color. Works great for a standard calculator. Cannot complain about it for the price."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Works as expected."},
{"rating": "5.0", "review_title": "easy to read display", "review_body": "Large, easy to read display.  My son actually asked for it to use during class.  Dual power is a plus."},
{"rating": "5.0", "review_title": "I ordered two of them", "review_body": "Perfect little calculator for my needs"},
{"rating": "5.0", "review_title": "Good small desk calculator", "review_body": "Performs as expected!  Good small desk calculator."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Quick delivery and great quality."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great price fast shipping"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Calculator was very good quality for the price.  I was please with it."},
{"rating": "1.0", "review_title": "One Star", "review_body": "junk"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Super cute and works like a charm!"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "nice"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Perfect."},
{"rating": "5.0", "review_title": "Great purchase overall!", "review_body": "Got several of these calculators and no problems after frequent warehouse use!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "great product"},
{"rating": "5.0", "review_title": "works great. my kid loves it", "review_body": "works great.  my kid loves it.  fast shipping."},
{"rating": "5.0", "review_title": "love it.", "review_body": "Affordable price, very clear number showing, love it."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Good product"},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "The buttons don't work very well, but it works."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Large buttons. Works"},
{"rating": "5.0", "review_title": "Great for gradeschool", "review_body": "Easy to reach buttons, option of solar power, great for children learning to use the calculator!"},
{"rating": "5.0", "review_title": "I didn't realize how often I reach for a calculator ...", "review_body": "I didn't realize how often I reach for a calculator for simple math until my old go-to calculator broke. (It hadnt survive my three year olds flying calculator experiment.) I needed something basic and this fit the bill."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great"},
{"rating": "3.0", "review_title": "It works fine.", "review_body": "It's a small desk top calculator. It works fine."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "My son uses it for school and really likes it"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "As described. Right for my need"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Seem to work just great AND their match our company logo!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Works great. Super fast shipping."},
{"rating": "1.0", "review_title": "Don't Buy!", "review_body": "Didn't Work! Junk!"},
{"rating": "5.0", "review_title": "\"Hola, choochoo!\"", "review_body": "We use this as a toy for our button-happy toddler. We don't like toys with electronics (noise, screens, lights, etc.) for a 2 year old, but this \"toy\" is great. He mashes these buttons instead of \"real\" electronics around the house. He also pretends it is a phone, and apparently calls his toy trains to chat, saying \"hola, choohoo!\" (he's smarter than me; learning a second language early). It gets dropped and occasionally thrown and keeps ticking. Oh yeah, it does some calculations too. :)"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "perfect for what I need, thanks"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Awesome! Just what I wanted."},
{"rating": "1.0", "review_title": "One Star", "review_body": "did not work. defective."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Very nice calculator."},
{"rating": "4.0", "review_title": "The calculators works just fine, and I like the bright blue color", "review_body": "I wish the display screen was tilted up more but that's just me. The calculators works just fine, and I like the bright blue color. The dimensions are 4\"W X 6\"L & the screen has approximately a 1/2\" tilt. It displays to the 8th digit."},
{"rating": "1.0", "review_title": "One Star", "review_body": "Total garbage!"},
{"rating": "2.0", "review_title": "If you try to use 10 key with any speed at all good luck cause the buttons stick and have to push ...", "review_body": "It is what it is, cheap.  Buttons feel cheap when pressing.  If you try to use 10 key with any speed at all good luck cause the buttons stick and have to push them way too hard in order to operate.  It still sits on my desk for some reason but I don't use it."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "It works"},
{"rating": "1.0", "review_title": "Design Flaw is Annoying", "review_body": "only thing I don't like about this calculator is that the base is smaller than the actual machine, so if you are adding up numbers quickly and don't hit the \"+\" dead center, the calculator will tip to the right. Annoying"},
{"rating": "5.0", "review_title": "Good buy", "review_body": "I bought this to keep at the nurses station at work to calculate I&O's etc it's seems to hold up rather well to daily use by a building full of nursing staff , display is large and easy to ready, and color is a bright , vibrant pink"},
{"rating": "4.0", "review_title": "large font calculator", "review_body": "i wanted a calculator that was \"large font\" style and this fulfills that idea...the bright blue plastic casing is fun and stands out on my desktop, so i can easily find it amidst my papers and desk supplies...one note, you need to \"charge\" the solar battery the first time you use it or else it will display a big E and not properly calculate...however after leaving it in the sun for a few hours on a windowsill, it worked just fine"},
{"rating": "1.0", "review_title": "I am so disappointed - it's a really cute calculator and thought it ...", "review_body": "It did not work straight out of the package.  We thought that maybe we needed to let it sit a while under light and then it should work, but it didn't and hasn't at all.  Nothing appears on the display.  I also thought that maybe it needed a battery although it was supposed to come with one. I tried to open the cover and couldn't.... I am so disappointed - it's a really cute calculator and thought it would be perfect for our daughter."},
{"rating": "3.0", "review_title": "Seller very good", "review_body": "This seller is very responsive to product related issues.  No complaints."},
{"rating": "1.0", "review_title": "One Star", "review_body": "Product arrived with a shattered display. Since it's so inexpensive, I didn't bother to return it."},
{"rating": "2.0", "review_title": "Don't be fooled by the \"color'", "review_body": "SInce it was given as a gift, the individual opened it on 10/19/14; but to her suprise the numbers 7 and 0 did not work.  Unfortunately, since the time ran out for returns, I cannot return the calculator."},
{"rating": "3.0", "review_title": "SOLAR POWER", "review_body": "SOLAR POWER ONLY no place for batteries. I returned it"},
{"rating": "1.0", "review_title": "One Star", "review_body": "I ordered it for my grandson. It  does not work!"},
{"rating": "2.0", "review_title": "Should have sprang for a Casio", "review_body": "You get what you pay for."},
{"rating": "3.0", "review_title": "Three Stars", "review_body": "I like it its eazy to find it because of the color."},
{"rating": "2.0", "review_title": "Great design for a basic function calculator", "review_body": "Great design for a basic function calculator. Unfortunately, cheaply assembled. I had ordered multiple calculators and had to return several as various number selections would not work."},
{"rating": "1.0", "review_title": "Cheap piece of crap. I would return it if I hadn't thrown ...", "review_body": "Cheap piece of crap.  I would return it if I hadn't thrown it out the window of my 8th floor building in anger."},
{"rating": "1.0", "review_title": "Numbers looked like hieroglyphics.", "review_body": "Arrived broken. Numbers looked like hieroglyphics."},
{"rating": "1.0", "review_title": "Don't waste your money. Belongs in the dollar store.", "review_body": "It's cheaply constructed."},
{"rating": "3.0", "review_title": "but otherwise I like", "review_body": "Needs bright lights..  won't work in my office, but otherwise I like it"},
{"rating": "1.0", "review_title": "THEY DO NOT WORK FOR VERY LONG!!!!", "review_body": "I ordered one of these calculators to start and when it came, I loved the size and functionality of it so much that I bought 4 more in various colors. Well, they certainly have not stood the test of time. Some of them lasted one month, some of them two months. Out of the five I purchased, I am left with one, just waiting for the day that is going to break. When I explained this to customer service they simply said, you are past the 30 days, sorry...  BEWARE! I buy a lot on Amazon and this is the worst customer service I have seen yet!"},
{"rating": "2.0", "review_title": "You get what you pay for.", "review_body": "I liked the color and size, but it feels cheap.  The battery was dead on arrival (it's sealed, so you can't replace the battery), so I returned it and did not re-order."},
{"rating": "1.0", "review_title": "I stocking stuffer present. Very disappointing, it does ...", "review_body": "I stocking stuffer present.  Very disappointing, it does not work.  The numbers half show up."},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "Small, cheap materials"},
{"rating": "2.0", "review_title": "Two Stars", "review_body": "The keys stick."},
{"rating": "1.0", "review_title": "One Star", "review_body": "complete fail!"},
{"rating": "2.0", "review_title": "and bottom of the calculator look like it has been used before", "review_body": "Interesting... It's brand new out of the package, however the face, top, and bottom of the calculator look like it has been used before. There are many abrasions and minor scratches everywhere. It's definitely a used calculator placed into new packaging. I'm also in agreement with another reviewer who states that the feet of the unit are not on the outside edges therefore causing the calculator to rock when you push certain buttons on the sides. Not sure if I'm going to send it back or not yet... See images, bear in mind this is exactly how it looked in my hands not more than two minutes out of the packaging."},
{"rating": "5.0", "review_title": "Works Great!", "review_body": "I love this calculator! The first thing I noticed was as soon as I opened it and pressed the \"on\" button it worked immediately. This is powered by a \"button cell\" battery, but it is also solar powered! I love this feature because even after the battery dies you can still use it. Just expose it to bright light. The number keys are pretty big, so no worries about pushing the wrong button. I have used this for a few days now, and it works absolutely fine. It also comes in several different colors, including black. I got the purple, which I happen to love. It has a slightly tilted display, so it is very easy to read. This calculator from Avalon would be perfect for home or office. I use mine at home to balance my checkbook. Works great! **I received this product at a discount for an honest and unbiased review. All opinions expressed are my own.**"},
{"rating": "5.0", "review_title": "The Avalon is an excellent basic calculator for those who like oversized number and function keys ...", "review_body": " Probably the most noticeable feature about these particular calculators are the oversized number and function keys.  I don't know how many times I've tried working with a smaller calculator, only to have to go back an redo my calculations.  Larger keys are a real plus because there's less chance I'll be accidentally hitting another one.  I'm not exactly from the generation of people who works with smaller keys / keyboards, so I definitely appreciate this fact."},
{"rating": "5.0", "review_title": "What a Vibrant color!", "review_body": "I love this purple calculator. The color is so bright and vibrant! The numbers are also very big and can be seen and read easily. I really like the fact that this calculator has a percentage key, as this is the key that I use most often in my retail business. The screen is already tilted upward helping to avoid glares from the sun. What a Great product! I am so happy to have had the opportunity to buy this item at a discount in exchange for my unbiased and honest review. Thanks A lot!"},
{"rating": "5.0", "review_title": "Avalon Calculator is a good quality product. Solid and stylish", "review_body": "1. Avalon 8 Digit Dual Powered Desktop Calculator has been a useful tool, from the time I received it."},
{"rating": "3.0", "review_title": "The feet (support pads) are too close together", "review_body": "It is a vibrant color and works very well. The only con I have is the feet (support pads) are too close together and it rocks when you push a button on either side, which is often. The odds are that the other colors are built the same way. I fixed it by putting stick-on pads to the outside of the body on the back, which is something one should NOT have to do. This product was provided at a discounted price in exchange for my honest review."},
{"rating": "5.0", "review_title": "I love everything about this calculator", "review_body": "I love everything about this calculator.  I love purple, so it's color is beautiful to me!  It's nice and big, easy to push the buttons.  I like the fact that it's solar powered. I do wish that it had an off button, but a lot of calculators do not.  It is well built and sturdy.  It feels like it would last a long time.  I would recommend this calculator to anyone."},
{"rating": "5.0", "review_title": "The perfect calculator", "review_body": "I liked the color purple. The size is perfect in that it is not too small to lose nor too big for a purse or on a desk. The numbers are a nice size easy to touch. The screen is easy to see the numbers. This calculator is powered by a solar panel and a battery. I like the feature of the dual power source. My 8 year old grandson could use it and my 82 year old mom also with ease. I received this calculator at a discount price for a honest review."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Great Product"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Perfect size for my daughter's work desk. She love the color"},
{"rating": "5.0", "review_title": "Add it up...", "review_body": "It works and is functional for what I need.  I like the color."},
{"rating": "5.0", "review_title": "Great product for the price", "review_body": "Compact yet big enough for larger hands.  Clear and easy to read display with dual power of solar and battery.  Great price and color - easy to find on your desk.  Bought a six pack for the office and so far am very pleased with them.  Right out of the box they worked with crisp display.  Good product for the cost."},
{"rating": "5.0", "review_title": "cutest calculator", "review_body": "really nice calculator"},
{"rating": "5.0", "review_title": "Calculated for efficiency!", "review_body": "So happy to get this calculator at a reduced price! It has all the basic bells and whistles that I need, with nice large buttons and a bright screen. Hard to misplace it with its vibrant color!"},
{"rating": "5.0", "review_title": "Great deal", "review_body": "Just what i was looking for. Inexpensive and not a whole lot of functions i'll never use. Big keys, large display. I just wish it had an \"off\" button. It turns off automatically, but i like to turn it off immediately after use."},
{"rating": "5.0", "review_title": "Terrific product - clear keyboard and user friendly", "review_body": "Fast, accurate service. Terrific product - clear keyboard and user friendly. I bought them for backpack stuffers for the beginning of school. These are totally appropriate for grades 1+."},
{"rating": "1.0", "review_title": "Crappy Calculator", "review_body": "Crappy Calculators....one was received open...both suck - you have to push hard and they skip numbers.  Don't be cheap like us and buy these...spend a bit more.  THESE ARE JUNK"},
{"rating": "1.0", "review_title": "It didn't make it through a single school year", "review_body": "We bought this in July.  It's February.  It no longer works.  It wasn't abused or anything; in fact, it still looks good.  But that's meaningless when it will not accept input from the keyboard.  We tried removing the battery, but it didn't make any difference.  Solar, batter, dual-power, whatever - this thing is dead."},
{"rating": "5.0", "review_title": "Easy to see and read Calculator", "review_body": "Easy to find in a drawer because the color is vibrant.  Easy to read because the display is large.  Very satisfied.  This seller contacted us to make sure we were pleased."},
{"rating": "3.0", "review_title": "I'm not sure it's much good for anything other than a toy", "review_body": "I wanted a calculator for my daughter to play with and this one fit the three criteria I was looking for: purple, big numbers, and I got a discount for agreeing to write a review.  I'm not sure it's much good for anything other than a toy, but the kiddo likes it."},
{"rating": "3.0", "review_title": "Liked the large buttons and spacing", "review_body": "Liked the large buttons and spacing, however, the = and x buttons started working inconsistently about 4 months into use. After a couple months of crossing my fingers and hitting the back of the calculator in hopes of a better connection, those buttons stopped working altogether."},
{"rating": "5.0", "review_title": "it is perfect for her to use for School", "review_body": "My daughter loves this calculator, it is perfect for her to use for School. Highly recommended. Thank you for letting me review this item for you!"},
{"rating": "5.0", "review_title": "Sturdy, durable", "review_body": "Purchased for my preschool classroom, for pretend play. Sturdy, durable, large buttons, bright color, couldn't be better."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Very satisfied with product."},
{"rating": "5.0", "review_title": "clear and easy to use", "review_body": "Got this for a elementary age kids.  Very, clear and easy to use.  Big buttons. Standard calculator.  Nice color."},
{"rating": "5.0", "review_title": "Awesome", "review_body": "Very good product! Was as described! Perfect for my daughter!"},
{"rating": "5.0", "review_title": "Avalon 8 digit", "review_body": "I really enjoyed the new Avalon calculator I received!! Big enough buttons so that I don't mistakenly hit other buttons!!! Plus it matches my stationary. I recommend this product!"},
{"rating": "5.0", "review_title": "Works fine", "review_body": "It works just fine, easy to read and use. No complaints here. All good, etc."},
{"rating": "4.0", "review_title": "Good product for price", "review_body": "Feels light and cheap but it's a tough little unit. Use it in warehouse and it gets a fair amount of abuse, gets dropped and tossed around all day long. Going to order half dozen more of different colors next quarter. Shipping was quick too."},
{"rating": "5.0", "review_title": "A fun pop of color 111", "review_body": "Beautiful bright color!! And works like a charm!"},
{"rating": "3.0", "review_title": "So-So", "review_body": "Battery doesn't work.  Needs lots of light to use the solarpower."},
{"rating": "5.0", "review_title": "Great Calculator", "review_body": "Great desktop calculator. I love the color makes it easier to find it. Nice big buttons. If you are looking for a calculator this is the one to buy."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "love this and love the color best one I wherever had"},
{"rating": "1.0", "review_title": "keep looking", "review_body": "Imo: Buy a different calculator.  After messing with this for a good half an hour it finally turned on...for about 3 minutes. I haven't gotten it to turn on again.  Waste of time and money."},
{"rating": "1.0", "review_title": "One Star", "review_body": "Garbage, stopped working shortly after getting it."},
{"rating": "5.0", "review_title": "my 6 yr old granddaughter loves playing office so this was the perfect pink.", "review_body": "Cute....my 6 yr old granddaughter loves playing office so this was the perfect pink."},
{"rating": "4.0", "review_title": "Pretty good for math", "review_body": "I like that the buttons were a decent size and that it handled math as expected."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Love these!!  Large display and buttons"},
{"rating": "5.0", "review_title": "Very happy.", "review_body": "Very happy with my purchase. Great price for the 6 on Prime Day. Now we can have calculators spread out around the worksite! No more \"where's the calculator\"."},
{"rating": "5.0", "review_title": "I really like it. perfect size", "review_body": "Just received my calculator. I really like it. perfect size, light weight and I really like the large buttons.. Other calculators I've had the buttons just seemed to be too small..It stores easily in my desk drawer."},
{"rating": "5.0", "review_title": "EXCELLENT", "review_body": "I REALLY LOVE THIS CALCULATOR THE COLOR AND EVERYTHING NUMBER IS BIG LIKE ME I HAVE A SMALL BUSINESS AND I USE A LOT OF THIS. GOOD QUALITY AND RECOMMENDED THANKS FOR THE SELLER GIVEN ME A CHANCE TO RECEIVED FREE."},
{"rating": "1.0", "review_title": "PIECE OF garbage", "review_body": "I bought this for my mom because of the large buttons and numbers. Never worked. It's a piece of CRAP!!!!!"},
{"rating": "1.0", "review_title": "One Star", "review_body": "Broken in 7 months. Doesn't worth it"},
{"rating": "5.0", "review_title": "great overall, as expected", "review_body": "The keys are easy to push, the color is vibrant. The numbers are large and easy to see on the buttons and on the screen."},
{"rating": "1.0", "review_title": "Only lasted a few months...", "review_body": "It worked great for the first few months and the buttons started to stick."},
{"rating": "5.0", "review_title": "Calculating", "review_body": "Received this sooner than I thought, Very cute and my daughter loved it."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "They are a good size for our students to use.  Large buttons."},
{"rating": "5.0", "review_title": "Great calculator", "review_body": "Great product"},
{"rating": "5.0", "review_title": "Awesome calculator", "review_body": "Love the calculator so far. The bright color helps us not lose it in our work place. The big numbers are great! Everything works fine as far as the power and display goes."},
{"rating": "5.0", "review_title": "I bought this calculator with a great deal requiring me to leave a review once received", "review_body": "I bought this calculator with a great deal requiring me to leave a review once received.  It is awesome!  Love the color, love the button size and number display screen.  Works great."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "They are fine."},
{"rating": "5.0", "review_title": "Great!", "review_body": "Love it! Needed one for my daughter before she started school and this is perfect, color and all!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "great"},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Bright color and perfect size to keep in my kitchen."},
{"rating": "4.0", "review_title": "Good calculator but not great.", "review_body": "Good calculator. Need to have light source to work. Display clear and big."},
{"rating": "5.0", "review_title": "Fun", "review_body": "Fun and easy to use, I have it at our front counter"},
{"rating": "5.0", "review_title": "Wow", "review_body": "Very surprised with the low price! The quality is excellent, easy to use."},
{"rating": "1.0", "review_title": "... a couple months ago and it's broken already very disappointed", "review_body": "I bought this a couple months ago and it's broken already very disappointed"},
{"rating": "5.0", "review_title": "five stars!", "review_body": "my office is dark so this exactly what I needed!"},
{"rating": "5.0", "review_title": "Simple and affordable", "review_body": "Simple and easy to use for the children who are utilizing this and it is not overpriced, can't ask for more."},
{"rating": "5.0", "review_title": "GREAT!", "review_body": "They arrived time, were a bargain, and work fine !"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "CUTE"},
{"rating": "5.0", "review_title": "Great little calculator", "review_body": "Excellentl calculator. Big numbers. Cool green."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "GREAT!!"},
{"rating": "1.0", "review_title": "One Star", "review_body": "After 1 month, the digital read out is buggered."},
{"rating": "1.0", "review_title": "One Star", "review_body": "Calculator does not work."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Love the color of this. Good little calculator for office."},
{"rating": "5.0", "review_title": "It is perfect for the job that I purchased it for", "review_body": "It is perfect for the job that I purchased it for.  And it does not need to be plugged in.  Awesome!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "love it!"},
{"rating": "5.0", "review_title": "Excellent purchase from an excellent seller. :)", "review_body": "Very clear. Very fun & bright! I love it. :)"},
{"rating": "1.0", "review_title": "One Star", "review_body": "The screen cracked within a week. The lcd display is flimsy."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "Item delivered as described."},
{"rating": "4.0", "review_title": "Four Stars", "review_body": "Awesome!!"},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "not bad, very big numbers and economical"},
{"rating": "1.0", "review_title": "not worth the price! Compares to something you could ...", "review_body": "not worth the price! Compares to something you could pick up for $1. I thought at this price it would be a bit nicer quality."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "I really like it!"},
{"rating": "2.0", "review_title": "Like Design, but Has Some Flaws", "review_body": "Great looks, but keys are gimpy and calculator is not stable if you hit keys on the edge of calculator - tends to tip over."},
{"rating": "5.0", "review_title": "Five Stars", "review_body": "i like it"}
]